[
  {
    "name": "afador",
    "description": "The Afador is a mixed breed dog–a cross between the Afghan Hound and Labrador Retriever dog breeds. Loyal, energetic, and affectionate, these pups inherited some of the best qualities from both of their parents.",
    "height": "20 to 29 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "50 to 75 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/afador-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "afaird",
    "description": "The Afaird is fairly new on the “designer dog” crossbreed scene. This mixed breed originates from two long-perfected and beloved dog breeds: the Afghan Hound and the Briard. This combination of traits is, to some, a match made in heaven. The Afaird’s unique look and big personality make them intriguing dogs for any dog parent looking to turn heads. Although the mixed breeding of the Afaird means there can be some variation in appearance, they often have Briard-inspired spotted coats draped over the elegant frame of the Afghan Hound.",
    "height": "22 to 24 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "60 to 80 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/07/My-project-1.jpg"
  },
  {
    "name": "affen border terrier",
    "description": "The Affen Border Terrier is new to the world of intentional crossbreeding, but they’re already turning heads. A mix between the Affenpinscher and the Border Terrier, they’re known for their wiry fur and strong-willed personalities. ",
    "height": "10 to 16 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "7 to 14 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/07/affen-border-terrier.png"
  },
  {
    "name": "affen spaniel",
    "description": "The Affen Spaniel is new on the scene of designer cross breeds that turn heads. To some the perfect dog, this crossbreed stems from the parent breeds Affenpinscher and Cocker Spaniel, both beloved family pets for many generations. This small and spunky pup brings charisma and silliness to many, and your home could be next. Affen Spaniels can thrive in a variety of home environments. Whether you’re a single dog parent or part of an active family, the Affen Spaniel could be a match.",
    "height": "10 to 20 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "15 to 20 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/07/affen-spaniel.png"
  },
  {
    "name": "affen tzu",
    "description": "As the popularity of designer dog breeds grows, certain ‘parent’ breeds have taken the spotlight. Of course, you’ve probably seen every “Doodle” cross you could imagine and then some! One of the more popular breeds to cross regarding small dogs is the Shih Tzu, prized for its adorable appearance and spunky personality. To some, the combination of the Shih Tzu and Affenpinscher, the ‘Affen Tzu’, is the ideal family pet. So what’s all the hype about this rising in popularity crossbreed? If you’re looking for a huge personality in a small package, a variety of coat colors, and a winning charm, the Affen Tzu might be your next furry family member.",
    "height": "9 to 11 inches",
    "lifeSpan": "13 to 15 years",
    "weight": "8 to 13lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/07/Screen-Shot-2022-07-25-at-4.43.41-PM.png"
  },
  {
    "name": "affenchon",
    "description": "The Affenchon is a crossbreed pup quickly rising in popularity. A mix between the Affenpinscher and the beloved Bichon Frise, this dog is known to be agile and spunky. Both breeds are known for low shedding, a trait sure to please any potential dog parent.",
    "height": "9 to 11 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "7 to 12 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/Screen-Shot-2022-08-04-at-1.42.32-PM.png"
  },
  {
    "name": "affengriffon",
    "description": "The Affengriffon is a unique and adorable crossbreed attracting attention from everyone they meet. To some the perfect dog, this crossbreed stems from the parent breeds Affenpinscher and Brussels Griffon, both beloved family pets for many generations. This adaptable dog can be right at home with just about anyone. Lots of their qualities make them great for first-time dog parents.",
    "height": "7 to 11 inches",
    "lifeSpan": "11 to 14 years",
    "weight": "7 to 12 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/affengriffon.png"
  },
  {
    "name": "affenhuahua",
    "description": "The Affenhuahua is a mixed breed dog–a cross between the Chihuahua and Affenpinscher dog breeds. Petite, sassy, and highly energetic, these pups inherited some of the best traits from both of their parents.",
    "height": "6 to 12 inches",
    "lifeSpan": "13 to 18 years",
    "weight": "4 to 12 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/02/affenhuahua-mixed-dog-breed-pictures-COVER.jpg"
  },
  {
    "name": "affenpinscher",
    "description": "Dogs of the Affenpinscher breed were originally created to act as ratters in homes, stables, and shops. Bred down in size, they moved up in the world, becoming ladies’ companions. Today, they are happy, mischievous companion dogs.",
    "height": "9 to 11 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "7 to 9 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23096_affenpinscher-460x290.jpg"
  },
  {
    "name": "affenpoo",
    "description": "The Affenpoo is a crossbreed dog joining the ranks of Poodle crosses. A mix between the lesser-known Affenpinscher and the Poodle, this dog is known to be intelligent and eager to learn. Although the cross occurs between any of the three recognized Poodle sizes, the Affenpoo’s most common parent is a Toy or Miniature Poodle.",
    "height": "10 to 18 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "10 to 25 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/affenpoo-1442x953.png"
  },
  {
    "name": "affenpug",
    "description": "The Affenpug is a charismatic crossbreed now turning heads. A mix between the Affenpinscher and the Pug, this small dog boasts their unique looks and big personality. With the Pug’s trademark smile and the Affenpinscher’s wiry coat, you’re unlikely to find any dog who looks like the Affenpug. ",
    "height": "9 to 12 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "7 to 16 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/affenpug-1442x948.png"
  },
  {
    "name": "affenshire",
    "description": "The Affenshire is new on the scene of crossbreed dogs rising in popularity. A mix between the Affenpinscher and the Yorkshire Terrier, this small dog is packed full of personality. This breed mix sports a winning smile and an endearingly scruffy coat. The Affenshire is sure to win over anyone they meet.",
    "height": "8 to 11 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "4 to 9 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/affenshire-1442x967.png"
  },
  {
    "name": "affenwich",
    "description": "The Affenwich is new on the scene of crossbreeds. To some the perfect dog, this crossbreed stems from the parent breeds Affenpinscher and Norwich Terrier, both beloved family pets for many generations. This pup has lots of energy, and they are best for an active home. Could that be you?",
    "height": "9 to 11 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "7 to 10 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/affenwich.png"
  },
  {
    "name": "afghan chon",
    "description": "The Afghan Chon is a unique, playful mixed breed rising in popularity. This crossbreed is a mix between the elegant Afghan Hound and the fluffy Bichon Frise. This newer cross is sure to keep winning hearts for years to come. They are known for a boisterous personality, along with uniquely curly fur. ",
    "height": "10 to 26 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "10 to 70 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/afghan-chon.png"
  },
  {
    "name": "afghan collie",
    "description": "The Afghan Collie is a unique, high-energy mix rising in popularity with many dog parents. A mix between the elegant Afghan Hound and the energetic Border Collie, this “designer dog” is sure to keep winning hearts for years to come. With that said, it’s important to keep in mind just how high-energy this beautiful dog can be.",
    "height": "22 to 27 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "50 to 65 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/afghan-collie.png"
  },
  {
    "name": "afghan hound",
    "description": "The Afghan Hound is elegance personified. This unique, ancient dog breed has an appearance quite unlike any other: dramatic silky coat, exotic face, and thin, fashion-model build. Looks aside, Afghan enthusiasts describe this hound as both aloof and comical.",
    "height": "24 to 26 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "50 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23004_afghan-hound-460x290.jpg"
  },
  {
    "name": "afghan retriever",
    "description": "The Afghan Retriever is a unique, playful mixed breed rising in popularity. A mix between the elegant Afghan Hound and the goofy and good-natured Golden Retriever, this ‘designer dog’ is sure to keep winning hearts for years to come. With that said, it’s important to keep in mind just how high-energy this playful mix can be.",
    "height": "23 to 26 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "50 to 70lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/Screen-Shot-2022-08-16-at-1.24.50-PM.png"
  },
  {
    "name": "afghan sheepdog",
    "description": "The Afghan Sheepdog is a unique, high-energy mix rising in popularity with many dog parents. A mix between the elegant Afghan Hound and the powerful Belgian Sheepdog, this “designer dog” is sure to keep winning hearts for years to come. With that said, it’s important to keep in mind just how high-energy this beautiful dog can be.",
    "height": "20 to 24 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "45 to 60 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/afghan-sheepdog-650x432.png"
  },
  {
    "name": "afghan spaniel",
    "description": "The Afghan Spaniel is a unique, playful mixed breed rising in popularity. A mix between the elegant Afghan Hound and the playful Cocker Spaniel, this newer cross is sure to keep winning hearts for years to come. ",
    "height": "19 to 23",
    "lifeSpan": "10 to 14 years",
    "weight": "30 to 45 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/afghan-spaniel.png"
  },
  {
    "name": "afollie",
    "description": "Sometimes, the only large crossbreed dogs that come to mind are infamous Doodle crosses. However, the Afollie is a unique mix rising in popularity with many dog parents. A mix between the beloved and elegant Afghan Hound and Collie, this “designer dog” is sure to keep winning hearts for years to come. ",
    "height": "22 to 27 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "45 to 55 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/Screen-Shot-2022-08-12-at-10.01.52-AM.png"
  },
  {
    "name": "airedale shepherd",
    "description": "The Airedale Shepherd is an energetic, intelligent crossbreed beloved by those who maintain active lifestyles. A mix between the confident Airedale Terrier and the loyal German Shepherd, this newer cross is sure to keep turning heads for years to come. ",
    "height": "24-26 inches",
    "lifeSpan": "10-12 years",
    "weight": "50-75 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/airedale-shepherd.jpg"
  },
  {
    "name": "airedale terrier",
    "description": "Known as the “King of Terriers,” the Airedale is indeed the largest of all terriers. The dog breed originated in the Aire Valley of Yorkshire and was created to catch otters and rats in the region between the Aire and Wharfe Rivers. An able sporting dog, they became an ideal working dog as well, proving their worth during World War I.",
    "height": "21 to 23 inches tall at the shoulder",
    "lifeSpan": "10 to 13 years",
    "weight": "40 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23050_airedale-terrier-460x290.jpg"
  },
  {
    "name": "airedoodle",
    "description": "The Airedoodle is one of the newest “Doodle” crosses to gain popularity, but now that they’re here, they’re sure to stay. A mix between the confident Airedale Terrier and the regal Standard Poodle, this newer cross is sure to keep turning heads for years to come. ",
    "height": "20 to 27 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "50 to 70 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/airedoodle.jpg"
  },
  {
    "name": "akbash",
    "description": "The Akbash is a rare, purebred dog from the country of Turkey. Loyal, alert, and intelligent, these pups have some of the best qualities you could ask for.",
    "height": "27 to 34 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "75 to 140 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/12/akbash-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "akbash pyrenees",
    "description": "The Akbash Pyrenees is a very large and very loyal new crossbreed. A mix between the elegant Akbash and the loyal Great Pyrenees, this newer cross is sure to keep winning hearts for years to come. ",
    "height": "28 to 34 inches",
    "lifeSpan": "8 to 12 years",
    "weight": "80 to 120 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/akbash-pyrenees-1442x950.png"
  },
  {
    "name": "akbash rottie",
    "description": "The Akbash Rottie is a large and eager-to-please new crossbreed that’s unknown by many. A mix between the elegant Akbash and the faithful Rottweiler, this newer cross is sure to keep winning hearts for years to come. ",
    "height": "28 to 34 inches",
    "lifeSpan": "8 to 11 years",
    "weight": "80 to 120 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/akbash-rottie-1442x956.png"
  },
  {
    "name": "aki-poo",
    "description": "The Aki-poo is a unique new crossbreed that’s still relatively unknown. A mix between the headstrong Akita and the regal Poodle, this newer cross is sure to keep turning heads for years to come. ",
    "height": "24 to 32 inches",
    "lifeSpan": "8 to 14 years",
    "weight": "70 to 100 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/aki-poo-1442x947.png"
  },
  {
    "name": "akita",
    "description": "The Akita is a large and powerful dog breed with a noble and intimidating presence. They were originally used for guarding royalty and nobility in feudal Japan. These dogs also tracked and hunted wild boar, black bear, and sometimes deer.",
    "height": "2 feet to 2 feet, 4 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "70 to 130 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22906_akita-460x290.jpg"
  },
  {
    "name": "akita basset",
    "description": "The Akita Basset is a unique new crossbreed that’s still relatively unknown. A mix between the headstrong Akita and the regal Basset Hound, this newer cross is sure to keep turning heads for years to come. ",
    "height": "15 to 28 inches",
    "lifeSpan": "8 to 12 years",
    "weight": "50 to 90 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/akita-basset-1442x948.png"
  },
  {
    "name": "akita bernard",
    "description": "The Akita Bernard is a large and loyal new crossbreed that’s still relatively unknown. A mix between the faithful, headstrong Akita and the loyal, easygoing Saint Bernard, this newer cross is sure to keep winning hearts for years to come. ",
    "height": "28 to 36 inches",
    "lifeSpan": "8 to 11 years",
    "weight": "90 to 175 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/GettyImages-526569563.jpg"
  },
  {
    "name": "akita chow",
    "description": "The Akita Chow is a mixed breed dog–a cross between the Akita and Chow Chow dog breeds. Large, independent, and loyal, these pups inherited some of the best traits from both of their parents.",
    "height": "23 to 25 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "88 to 145 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/04/akita-chow-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "akita pit",
    "description": "The Akita Pit is a mixed breed dog–a cross between the Akita and American Pit Bull Terrier dog breeds. Intelligent, protective, and loyal, these pups inherited some of the best traits from both of their parents.",
    "height": "16 to 23 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "30 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/02/akita-pit-mixed-dog-breed-pictures-COVER.jpg"
  },
  {
    "name": "akita shepherd",
    "description": "An Akita Shepherd is a mixed breed dog–a cross between the Akita and German Shepherd Dog breeds. Stoic, loyal, and hard-working, these pups inherited some of the best traits from both of their parents.",
    "height": "24 to 28 inches",
    "lifeSpan": "10 to 13 years",
    "weight": "75 to 120 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/03/akita-shepherd-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "akitamatian",
    "description": "The Akitamatian is a large and eager-to-please new crossbreed that’s unknown by many. A mix between the faithful, headstrong Akita and the goofy, exuberant Dalmatian, this newer cross is sure to keep winning hearts for years to come. ",
    "height": "24 to 34 inches",
    "lifeSpan": "8 to 12 years",
    "weight": "85 to 115 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/akitamatian-1442x953.png"
  },
  {
    "name": "alaskan goldenmute",
    "description": "The Alaskan Goldenmute is an energetic, boisterous crossbreed beloved by active individuals. A mix between the driven Alaskan Malamute and the American classic Golden Retriever, this newer cross is sure to keep turning heads for years to come. ",
    "height": "24 to 28 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "50 to 70 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/08/alaskan-goldenmute-1442x957.png"
  },
  {
    "name": "alaskan husky shepherd",
    "description": "The Alaskan Husky Shepherd is an energetic, driven crossbreed beloved by those who maintain active lifestyles. This is a cross between the powerful Alaskan Husky and the loyal German Shepherd; for active dog parents, this breed is sure to only keep growing loyal fans. Keep in mind that this breed mix comes from two breeds who are energetic enough on their own. If you plan to add one to your family, do a bit of studying to ensure that this is the right match for you.",
    "height": "20 26 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "40 to 70 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/alaskan-husky-shepherd-1442x952.png"
  },
  {
    "name": "alaskan irish setsky",
    "description": "The Alaskan Irish Setsky is an energetic, playful crossbreed beloved by those who maintain active lifestyles. This is a cross between the driven Alaskan Husky and the friendly Irish Setter. For active dog parents, this breed is sure to only keep growing loyal fans.",
    "height": "20-26 inches",
    "lifeSpan": "10-14 years",
    "weight": "40-65 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/alaskan-irish-setsky-1442x959.png"
  },
  {
    "name": "alaskan klee kai",
    "description": "Small, smart, and energetic, the Alaskan Klee Kai is a relatively new breed that looks like a smaller version of the Siberian Husky. Even the name “Klee Kai” comes from an Inuit term meaning “small dog.”",
    "height": "13 to 17 inches",
    "lifeSpan": "12 to 16 years",
    "weight": "10 to 15 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2017/11/alaskan-klee-kai-breed-pictures-cover-460x260.jpg"
  },
  {
    "name": "alaskan malador",
    "description": "The Alaskan Malador is an energetic, boisterous crossbreed beloved by active individuals. Occasionally also called the Labramute, this cross between the driven Alaskan Malamute and the good-natured Labrador Retriever is sure to keep turning heads for years to come. ",
    "height": "24 to 28 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "50 to 80 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/alaskan-malador-1442x953.png"
  },
  {
    "name": "alaskan malamute",
    "description": "The Alaskan Malamute features a powerful, sturdy body built for stamina and strength. It reigns as one of the oldest dog breeds whose original looks have not been significantly altered. This intelligent canine needs a job and consistent leadership to avoid becoming bored or challenging to handle.",
    "height": "1 foot, 11 inches to 2 feet, 1 inch tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "75 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22908_alaskan-malamute-460x290.jpg"
  },
  {
    "name": "alaskan pit bull terrier",
    "description": "The Alaskan Pit Bull is an energetic, playful crossbreed beloved by those who maintain active lifestyles. This is a cross between the driven Alaskan Malamute and the playful American Pit Bull Terrier. For active dog parents, this breed is sure to only keep growing loyal fans.",
    "height": "20 to 26 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "60 to 75 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/alaskan-pit-bull-1.jpg"
  },
  {
    "name": "alaskan shepherd",
    "description": "The Alaskan Shepherd is an energetic, intelligent crossbreed. Best suited for those who maintain active lifestyles, this breed is a cross between the driven Alaskan Malamute and the loyal German Shepherd. This unique breed mix sports a stunningly wolflike appearance — and somewhat of a wolflike disposition.",
    "height": "24 to 28 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "50 to 90 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/alaskan-shepherd-1442x949.png"
  },
  {
    "name": "alaskan weimsky",
    "description": "The Alaskan Weimsky is an energetic, driven crossbreed beloved by those who maintain active lifestyles. This is a cross between the sleek Weimaraner and the hard-working Alaskan Husky; for active dog parents, this breed is sure to only keep growing loyal fans.",
    "height": "20 to 24 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "50 to 85 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/alaskan-weimsky-1442x953.png"
  },
  {
    "name": "alusky",
    "description": "The Alusky is an energetic, playful crossbreed beloved by those who maintain active lifestyles. This is a cross between the driven Alaskan Husky and the similar, larger Alaskan Malamute. For active dog parents, this breed is sure to only keep growing loyal fans.",
    "height": "20-26 inches",
    "lifeSpan": "10-12 years",
    "weight": "40-85 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/alusky-1442x955.png"
  },
  {
    "name": "american bandogge",
    "description": "The American Bandogge, also known as the Bandog, is a feisty crossbreed beloved by those who don’t mind a big body with a bigger attitude (and a heart of gold). This is a cross between the ancient, massive Mastiff and the hardworking American Bulldog. For active dog parents, this breed is sure to only keep growing loyal fans.",
    "height": "19-22 inches",
    "lifeSpan": "8-10 years",
    "weight": "100-120 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/american-bandogge.jpg"
  },
  {
    "name": "american boston bull terrier",
    "description": "The American Boston Bull Terrier is a feisty crossbreed beloved by those who don’t mind a little spunkiness. This is a cross between the bossy Boston Terrier and the playful American Pit Bull Terrier. For active dog parents, this breed is sure to only keep growing loyal fans.",
    "height": "15-20 inches",
    "lifeSpan": "10-14 years",
    "weight": "10-30 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/american-boston-bull-terrier.jpg"
  },
  {
    "name": "american boxer foxhound",
    "description": "The American Boxer Foxhound is a newer crossbreed originating for dog parents who need a fun-loving but good-natured pup at their sides. This is a cross between the energetic but mild-mannered American Foxhound and the protective but goofy Boxer. For experienced, confident dog parents, this breed is sure to only keep growing loyal fans. ",
    "height": "21 to 26 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "45 to 65 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/american-boxer-foxhound-1.png"
  },
  {
    "name": "american bull-aussie",
    "description": "The American Bull-Aussie is a newer crossbreed making waves with dog parents. They are ideal for dog parents who need a loyal, active pup at their sides. This is a cross between the relentlessly loyal, often silly American Bulldog and the hardworking, energetic Australian Shepherd. For experienced, confident dog parents, this breed is sure to only keep growing loyal fans.",
    "height": "16 to 23 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "50 to 70 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/American-Bull-Aussie.png"
  },
  {
    "name": "american bull dane",
    "description": "The American Bull Dane is a strong crossbreed beloved by those who don’t mind a big body with a bigger attitude (and a heart of gold). This is a cross between the relentlessly loyal, often silly American Bulldog and the gentle Great Dane. For experienced, confident dog parents, this breed is sure to only keep growing loyal fans.",
    "height": "27 to 35 inches",
    "lifeSpan": "8 to 10 years",
    "weight": "120 to 200 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/american-bull-dane-1442x954.png"
  },
  {
    "name": "american bull dogue de bordeaux",
    "description": "The American Bull Dogue De Bordeaux is a strong crossbreed beloved by those who don’t mind a big body with a bigger attitude (and a heart of gold). This is a cross between the relentlessly loyal, often silly American Bulldog and the hardworking Dogue De Bordeaux. For experienced, confident dog parents, this breed is sure to only keep growing loyal fans.",
    "height": "22 to 24 inches",
    "lifeSpan": "8 to 12 years",
    "weight": "80 to 130 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/American-Bull-Dogue-De-Bordeaux-1442x958.png"
  },
  {
    "name": "american bull-jack",
    "description": "The American Bull-Jack is a newer crossbreed originating for dog parents who need a loyal, active pup at their sides. This is a cross between the relentlessly loyal, often silly American Bulldog and the small but feisty Jack Russell Terrier. For experienced, confident dog parents, this breed is sure to only keep growing loyal fans.",
    "height": "10 to 25 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "17 to 50 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/American-Bull-Jack.png"
  },
  {
    "name": "american bull pei",
    "description": "The American Bull Pei is a strong, energetic crossbreed beloved by those who don’t mind a big body with a bigger attitude (and a heart of gold). This is a cross between the relentlessly loyal Chinese Shar-Pei and the hardworking American Bulldog. For active dog parents, this breed is sure to only keep growing loyal fans.",
    "height": "14 to 18 inches",
    "lifeSpan": "9 to 12 years",
    "weight": "50 to 80 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/american-pull-pei-1442x957.png"
  },
  {
    "name": "american bull staffy",
    "description": "The American Bull Staffy is a strong, energetic crossbreed beloved by those who don’t mind a big body with a bigger personality (and a heart of gold). This is a cross between the playful but driven American Staffordshire Terrier and the hardworking American Bulldog. For active dog parents, this breed is sure to only keep growing loyal fans.",
    "height": "17 to 20 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "50 to 80 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/american-bull-staffy.jpg"
  },
  {
    "name": "american bulldog",
    "description": "The American Bulldog is stocky and muscular, but also agile and built for chasing down stray cattle and helping with farm work. In fact, some are known to jump six feet or more into the air.",
    "height": "20 to 28 inches",
    "lifeSpan": "10 to 16 years",
    "weight": "60 to 120 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2017/12/american-bulldog-breed-pictures-9-460x260.jpg"
  },
  {
    "name": "american bulldog shepherd",
    "description": "The American Bulldog Shepherd is a newer crossbreed originating for dog parents who need a loyal and active — not hyper — companion. This is a cross between the relentlessly loyal, often silly American Bulldog and the sometimes serious, sometimes playful German Shepherd. For experienced, confident dog parents, this breed is sure to only keep growing loyal fans.",
    "height": "20 to 27 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "60 to 120 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/american-bulldog-shepherd.png"
  },
  {
    "name": "american bullhuahua",
    "description": "The American Bullhuahua is a newer crossbreed originating for dog parents who need a fun-loving but not large pup at their sides. This is a cross between the relentlessly loyal, often silly American Bulldog and the excitable, feisty Chihuahua. For experienced, confident dog parents, this breed is sure to only keep growing loyal fans. Despite their smaller size, this breed can make an amazing watchdog and companion.",
    "height": "9 to 12 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "20 to 35 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/American-Bullhuahua.png"
  },
  {
    "name": "american bullweiler",
    "description": "The American Bullweiler is a newer crossbreed originating for dog parents who need a loyal, active but not hyper companion. This is a cross between the relentlessly loyal, often silly American Bulldog and the respectable, family-oriented Rottweiler. For experienced, confident dog parents, this breed is sure to only keep growing loyal fans.",
    "height": "20 to 28 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "60 to 90 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/09/american-bullweiler.png"
  },
  {
    "name": "american chow bulldog",
    "description": "The American Chow Bulldog is a newer crossbreed originating for dog parents who need a fun-loving but protective pup at their side. This is a cross between the large and in charge American Bulldog and the protective Chow Chow. For experienced, confident dog parents, this breed is sure to only keep growing loyal fans. This breed can make an amazing watchdog and companion for those with lots of dog experience.",
    "height": "12 to 20 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "45 to 70 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/American-Chow-Bulldog.png"
  },
  {
    "name": "american eagle dog",
    "description": "A newer crossbreed, the American Eagle Dog is a mix between the elegant yet pint-sized American Eskimo Dog and the hardy, easy-to-love American classic Beagle. This breed mix boasts an adorable stature. For experienced, confident dog parents, this breed mix is sure to only keep growing loyal fans. This breed can make an amazing companion for those with lots of previous dog experience, particularly past familiarity with hounds.",
    "height": "12 to 18 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "20 to 35 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/american-eagle-dog.png"
  },
  {
    "name": "american english coonhound",
    "description": "A descendent of the English Foxhound, the American English Coonhoound is a hunting dog breed known for their speed, endurance, and loud voice in the field. The’ll bark and bay at home, too, making them a poor choice if you’ve got nearby neighbors. They need lots of exercise.",
    "height": "23 to 26 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23236_american-english-coonhound-460x290.jpg"
  },
  {
    "name": "american eskimo dog",
    "description": "Called “the dog beautiful” by admirers, the American Eskimo Dog, or “Eskie,” is a striking canine with their white coat, sweet expression, and black eyes. They’re a Nordic dog breed, a member of the Spitz family.",
    "height": "15 to 19 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "starts at 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23134_american-eskimo-dog-460x290.jpg"
  },
  {
    "name": "american foxeagle",
    "description": "A cross between the energetic but mild-mannered American Foxhound and the hardy, easy to love American classic Beagle, the American Foxeagle is a newer crossbreed comprised of two older and long-beloved breeds. For experienced, confident dog parents, this breed is sure to only keep growing loyal fans. This breed can make an amazing companion for those with lots of previous dog experience, particularly past familiarity with hounds.",
    "height": "17 to 23 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "30 to 50lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/american-foxeagle.png"
  },
  {
    "name": "american foxhound",
    "description": "Easygoing, sweet, kind, and loyal, the American Foxhound dog breed belongs to a way of life that has continued for more than two centuries, but they have the potential to be a modern-day companion as well.",
    "height": "21 to 25 inches tall at the shoulder",
    "lifeSpan": "12 to 13 years",
    "weight": "40 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23006_american-foxhound-460x290.jpg"
  },
  {
    "name": "american foxy dane",
    "description": "The American Foxy Dane is a newer crossbreed comprised of two older and long-beloved breeds. This is a cross between the energetic but mild-mannered American Foxhound and the oversized but gentle Great Dane. For experienced, confident dog parents, this breed mix is sure to only keep growing loyal fans. This breed can make an amazing companion for those with lots of previous dog experience, particularly past familiarity with hounds.",
    "height": "25 to 28 inches",
    "lifeSpan": "8 to 10 years",
    "weight": "50 to 90 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/american-foxy-dane.png"
  },
  {
    "name": "american french bull terrier",
    "description": "The American French Bull Terrier is a newer crossbreed originating for dog parents who need a fun-loving but not large pup at their sides. This is a cross between the brave and loyal, often silly American Pit Bull Terrier and the similarly goofy but much smaller French Bulldog. For experienced, confident dog parents, this breed is sure to only keep growing loyal fans. Despite their smaller size, this breed can make an amazing watchdog and companion.",
    "height": "8 to 12 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "25 to 50 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/American-French-Bull-Terrier.png"
  },
  {
    "name": "american hairless terrier",
    "description": "The American Hairless Terrier is the only hairless dog breed indigenous to the United States, and the breed’s creation was something of a happy accident. Today, the breed is known as an active companion dog and an especially great choice for allergy sufferers.",
    "height": "12 to 16 inches",
    "lifeSpan": "13 to 16 years",
    "weight": "10 to 16 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/04/american-hairless-terrier-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "american lab foxhound",
    "description": "The American Lab Foxhound is a newer crossbreed originating for dog parents who need a fun-loving but boundlessly loyal. This is a cross between the energetic but mild-mannered American Foxhound and the hardworking but silly Labrador Retriever. For experienced, confident dog parents, this breed is sure to only keep growing loyal fans. This breed can make an amazing companion for those with previous high-energy dog experience.",
    "height": "23 to 27 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "50 to 75 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/american-lab-foxhound.png"
  },
  {
    "name": "american leopard hound",
    "description": "The American Leopard Hound is a purebred dog whose ancestors came from Mexico by way of Spanish conquistadors who sailed to North America. They are energetic, sociable, and intelligent pooches who possess all-around great traits.",
    "height": "21 to 27 inches.",
    "lifeSpan": "12 to 15 years.",
    "weight": "35 to 75 pounds.",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/american-leopard-hound-dog-breed-picture-cover.jpg"
  },
  {
    "name": "american molossus",
    "description": "The American Molossus is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a loyal friend who can serve as both a guard dog and companion. This is a cross between two well-loved large breeds: the American Bulldog and the Neopolitan Mastiff. This breed is not only large in size, but they have huge personalities, too.",
    "height": "23 to 26 inches",
    "lifeSpan": "7 to 10 years",
    "weight": "60 to 100 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/American-Molossus.jpg"
  },
  {
    "name": "american pit bull terrier",
    "description": "The American Pit Bull Terrier is a companion and family dog breed. Originally bred to “bait” bulls, the breed evolved into all-around farm dogs, and later moved into the house to become “nanny dogs” because they were so gentle around children.",
    "height": "17 to 19 inches tall at the shoulder",
    "lifeSpan": "12 to 16 years",
    "weight": "30 to 85 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23052_pitbull-dog-breed-pittie.jpg"
  },
  {
    "name": "american pit corso",
    "description": "The American Pit Corso is a newer crossbreed composed from two older and long-beloved breeds, originating for dog parents who need a fun-loving but boundlessly loyal dog. This is a cross between the goofy but intelligent American Pit Bull Terrier along with the stocky and confident Cane Corso. For experienced, confident dog parents, this breed is sure to only keep growing loyal fans. This breed can make an amazing companion for those with lots of previous dog experience.",
    "height": "25 to 35 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "75 to 155lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/american-pit-corso.png"
  },
  {
    "name": "american pugabull",
    "description": "The American Pugabull is a mixed breed dog — a cross between the American Bull Dog and Pug dog breeds. Medium in size, alert, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "12 to 20 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "25 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/american-pugabull-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "american rat pinscher",
    "description": "The American Rat Pinscher is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the American Rat Terrier and the Miniature Pinscher. This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "9 to 13 inches",
    "lifeSpan": "12 to 16 years",
    "weight": "6 to 10lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/american-rat-pinscher-1442x947.png"
  },
  {
    "name": "american staffordshire terrier",
    "description": "The American Staffordshire Terrier is a muscular breed known for being strong for its size; however, they’re also loving and affectionate with human family members. American Staffordshire Terriers enjoy nothing more than being with the humans they care about, whether they’re out for a jog, playing in the yard, or cuddling up on the couch.",
    "height": "16 to 19 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "40 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2018/01/american-staffordshire-terrier-dog-breed-pictures-cover-460x260.jpg"
  },
  {
    "name": "american water spaniel",
    "description": "The American Water Spaniel was bred to be an all-around hunting dog. Specializing in waterfowl, these skilled swimmers will happily retrieve from small boats, protected by their water-resistant double coats.",
    "height": "1 foot, 3 inches to 1 foot, 6 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "25 to 45 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22954_american-water-spaniel-460x290.jpg"
  },
  {
    "name": "amstiff",
    "description": "The Amstiff is a newer crossbreed originating for dog parents who need a fun-loving but protective pup at their sides. This is a cross between the playful but driven American Staffordshire Terrier and the gentle giant Mastiff. For experienced, confident dog parents, this breed is sure to only keep growing loyal fans. This breed can make an amazing watchdog and companion for those with lots of previous dog experience.",
    "height": "20 to 30 inches",
    "lifeSpan": "8 to 10 years",
    "weight": "80 to 130 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/amstiff.png"
  },
  {
    "name": "anatolian pyrenees",
    "description": "The Anatolian Pyrenees is a newer cross composed from two older and long-beloved breeds. They originated for dog parents who need a fun-loving but boundlessly loyal dog. This is a cross between two livestock guardian breeds: the Anatolian Shepherd along with the Great Pyrenees. For experienced, confident dog parents, this large and in charge breed is sure to only keep growing loyal fans. This breed can make an amazing, gentle companion for those with lots of previous dog experience.",
    "height": "29 to 32 inches",
    "lifeSpan": "9 to 12 years",
    "weight": "80 to 120 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/Screen-Shot-2022-11-15-at-3.43.53-PM.png"
  },
  {
    "name": "anatolian shepherd dog",
    "description": "The Anatolian Shepherd Dog is a native of Turkey, where they were bred as a shepherd’s companion and livestock guardian. They were created with specific traits to resemble the size and color of livestock they defended so predators wouldn’t detect them among the flock.",
    "height": "2 feet, 3 inches to 2 feet, 5 inches tall at the shoulder",
    "lifeSpan": "11 to 13 years",
    "weight": "80 to 150 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22910_anatolian-shepherd-dog-460x290.jpg"
  },
  {
    "name": "appenzeller sennenhunde",
    "description": "The Appenzeller Sennenhunde originated as an all-around farm dog breed, who stayed busy herding the livestock, guarding the farm, and pulling carts in their native Switzerland. Today’s Appenzellers still have the energy, smarts, and self-confidence that makes for valuable working dogs — but they’re anything but low-maintenance.",
    "height": "19 to 22 inches tall at the shoulder",
    "lifeSpan": "9 to 12 years",
    "weight": "48 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23244_what-is-the-appenzeller-sennenhunde-dog.jpg"
  },
  {
    "name": "auggie",
    "description": "The Auggie is a mixed breed dog–a cross between the Australian Shepherd and Corgi, and typically, the Miniature Australian Shepherd and the Pembroke Welsh Corgi. Friendly, energetic, and playful, these mixed breed herding dogs make great companions for the whole family.",
    "height": "10 to 13 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "20 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/auggie-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "aussalier",
    "description": "The Aussalier is a crossbreed composed from two older and long-beloved breeds. For dog parents who need a small and playful companion with the best of both parents’ traits, look no further. This is a cross between two popular breeds: the Cavalier King Charles Spaniel and the Australian Shepherd. This breed is fairly short in stature, but huge in personality. They are a rewarding companion for many different lifestyles.",
    "height": "12 to 16 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "15 to 30lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/ausselier.jpg"
  },
  {
    "name": "aussie-chi",
    "description": "The Aussie-Chi is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need an intelligent, playful companion. This is a cross between two popular breeds: the medium-sized Australian Shepherd and the small Chihuahua. This breed isn’t too tall, but they’re huge in personality, and can be a rewarding companion.",
    "height": "12 to 16 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "10 to 26 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2023/01/aussie-chi.jpg"
  },
  {
    "name": "aussie rottie",
    "description": "The Aussie Rottie is a newer crossbreed composed from two older and long-beloved breeds. Dog parents who need a fun-loving but boundlessly loyal dog should consider this mix. ",
    "height": "23 to 25 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "55 to 80 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/aussie-rottie.png"
  },
  {
    "name": "aussie shiba",
    "description": "The Aussie Shiba is a newer crossbreed composed from two older and long-beloved breeds. Dog parents who need a fun-loving but boundlessly loyal dog should consider this mix.",
    "height": "15 to 24 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "20 to 45 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/Aussie-Shiba.png"
  },
  {
    "name": "aussiedoodle",
    "description": "The Aussiedoodle is a mixed breed dog — a cross between the Australian Shepherd and Poodle dog breeds. Incredibly smart, playful, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "10 to 15 inches",
    "lifeSpan": "10 to 13 years",
    "weight": "25 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/aussiedoodle-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "aussiepom",
    "description": "The Aussiepom is a mixed breed dog — a cross between the Australian Shepherd and Pomeranian dog breeds. Affectionate, fun-loving, and nothing short of adorable, these pups inherited some of the best traits from their parents.",
    "height": "11 to 17 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "10 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/aussiepom-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "australian bernedoodle",
    "description": "The Australian Bernedoodle is a fun variation on the common Goldendoodle.  This is a cross between four popular large breeds: the Australian Shepherd, the Labrador Retriever, the Bernese Mountain Dog and the Poodle (typically, the Standard Poodle). This crossbreed is energetic and athletic, and can keep up (or outdo you!) at many outdoor activities.",
    "height": "20 to 27 inches",
    "lifeSpan": "8 to 11 years",
    "weight": "60 to 95 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/australian-bernedoodle.jpg"
  },
  {
    "name": "australian boxherd",
    "description": "The Australian Boxherd is a newer crossbreed composed from two older and long-beloved breeds. Dog parents who need a fun-loving but boundlessly loyal dog should consider this mix. ",
    "height": "23 to 25 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "6 to 80 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/Australian-Boxherd-1442x923.png"
  },
  {
    "name": "australian cattle dog",
    "description": "The Australian Cattle Dog is an extremely intelligent, active, and sturdy dog breed. Developed by Australian settlers to handle herds of cattle on expansive ranches, they’re still used today as a herding dog. They thrive on having a job to do and on being part of all family activities.",
    "height": "17 to 20 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "30 to 50 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23166_australian-cattle-dog-460x290.jpg"
  },
  {
    "name": "australian kelpie",
    "description": "The Australian Kelpie was originally bred to have the energy, intelligence, and independence to herd livestock all day in the hot Australian climate without much need for supervision. They retain those qualities to this day.",
    "height": "15 to 20 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "25 to 46 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2018/04/australian-kelpie-dog-breed-pictures-header-460x260.jpg"
  },
  {
    "name": "australian labradoodle",
    "description": "The Australian Labradoodle is a crossbreed composed from three beloved breeds. They are developed for dog parents who need a companion who can function as either a working dog or simply a dedicated and loyal pet. This is a cross between three popular large breeds: the Australian Shepherd, the Labrador Retriever, and the Poodle (typically, the Standard Poodle). This crossbreed is energetic and athletic. They can keep up (or outdo you!) at many outdoor activities.",
    "height": "20 to 25 inches",
    "lifeSpan": "9 to 14 years",
    "weight": "50 to 90 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/australian-labradoodle.jpg"
  },
  {
    "name": "australian retriever",
    "description": "The Australian Retriever is a mixed breed dog–a cross between the Australian Shepherd and Golden Retriever dog breeds. Loyal, intelligent, and friendly, these pups inherited some of the best traits from both of their parents.",
    "height": "19 to 23 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "25 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/10/australian-retriever-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "australian shepherd",
    "description": "Despite their name, the Australian Shepherd dog breed originated in the western United States, not Australia, around the time of the Gold Rush in the 1840s. Originally bred to herd livestock, they remain a working dog at heart.",
    "height": "18 to 23 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "40 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23168_australian-shepherd-460x290.jpg"
  },
  {
    "name": "australian shepherd husky",
    "description": "The Australian Shepherd Husky is a mixed breed dog — a cross between the Australian Shepherd and Siberian Husky dog breeds. These active dogs are protective and loyal and inherited some of the best traits from both of their parents.",
    "height": "18 to 25 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "40 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/12/australian-shepherd-husky-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "australian shepherd lab mix",
    "description": "The Australian Shepherd Lab Mix is a mixed breed dog — a cross between the Australian Shepherd and the Labrador Retriever dog breeds. Medium in size, energetic, and loyal, these pups inherited some amazing traits from both of their parents.",
    "height": "22 to 25 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "40 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/12/australian-shepherd-lab-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "australian shepherd pit bull mix",
    "description": "The Australian Shepherd Pit Bull Mix is a mixed breed dog — a cross between the Australian Shepherd and Pit Bull dog breeds. Energetic, loyal, and quick to learn new things, these pups inherited some of the best traits from both of their parents.",
    "height": "17 to 23 inches",
    "lifeSpan": "10 to 16 years",
    "weight": "30 to 85 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/australian-shepherd-pit-bull-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "australian stumpy tail cattle dog",
    "description": "The Australian Stumpy Tail Cattle Dog, named for their characteristic short or sometimes non-existent tail, is a descendant of wild dingoes and domesticated herding dogs from the late 19th century. Although similar to the popular Australian Cattle Dog, the Australian Stumpy Tail Cattle Dog is leaner, tailless, and more alert when it comes to strangers and new situations.",
    "height": "17 to 20 inches",
    "lifeSpan": "13 to 15 years",
    "weight": "35 to 51 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/05/Australian-Stumpy-Tail-Cattle-Dog-cover.jpg"
  },
  {
    "name": "australian terrier",
    "description": "The Australian Terrier was developed in Australia, as their name implies. Bred to hunt rodents and snakes, Australian Terriers were also prized as watchdogs and companions. Today, the breed maintains those same traits: they’re delightful companions, fierce earthdog competitors, and conformation and obedience showdogs.",
    "height": "10 to 11 inches tall at the shoulder",
    "lifeSpan": "up to 15 years",
    "weight": "14 to 16 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23054_australian-terrier-460x290.jpg"
  },
  {
    "name": "azawakh",
    "description": "A dog breed named for the Azawakh Valley in the Sahara desert where they originated, this is a lean and swift hunter with a regal presence. They’re proud but loyal and protective of their home and family.",
    "height": "23 to 27 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "33 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23286_azawakh-460x290.jpg"
  },
  {
    "name": "ba-shar",
    "description": "The Ba-Shar is a newer crossbreed composed from two older and long-beloved breeds, originating for dog parents who need a low-energy canine companion. This is a cross between the relaxed Basset Hound and the protective Shar-Pei. For confident dog parents, this breed is sure to only keep growing loyal fans. This breed can make an amazing companion for those who have previous experience with stubborn breeds.",
    "height": "12 to 15 inches",
    "lifeSpan": "8 to 10 years",
    "weight": "40 to 65 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/Ba-Shar-1442x952.png"
  },
  {
    "name": "bagle hound",
    "description": "The Bagle Hound is a newer crossbreed composed from two older and long-beloved breeds, originating for dog parents who need a relaxed canine companion. This is a cross between the relaxed Basset Hound and the playful, good-natured Beagle. For confident dog parents, this breed is sure to only keep growing loyal fans. This breed can make an amazing companion, even for those without lots of previous experience with dogs. ",
    "height": "12 to 15 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "30 to 50 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/Bagle-Hound.png"
  },
  {
    "name": "barbado da terceira",
    "description": "The Barbado da Terceira dog breed was developed on the Portuguese island of Terceira to work herding cattle and guarding livestock. Today this medium-sized breed is known for being loyal and smart.",
    "height": "19 to 22 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "46 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2021/05/Barbado-da-Terceira-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "barbet",
    "description": "This woolly sporting dog breed is fun-loving and smart. The Barbet was bred for retrieving waterfowl for hunters — and has the webbed feet to prove it — but they’re also a talented agility competitor in their native France.",
    "height": "20 to 25 inches tall at the shoulder",
    "lifeSpan": "13 to 15 years",
    "weight": "37 to 62 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23288_barbet-460x290.jpg"
  },
  {
    "name": "bascottie",
    "description": "The Bascottie is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need an intelligent yet typically laid-back companion. This is a cross between the relaxed Basset Hound and the independent Scottish Terrier. For confident dog parents, this breed is sure to only keep growing loyal fans. This breed can make an amazing companion for those who have previous experience with stubborn breeds.",
    "height": "10 to 15 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "20 to 45 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/Bascottie-1442x922.png"
  },
  {
    "name": "basenji",
    "description": "Out of Africa, the Basenji dog breed was originally found in the Congo. These dogs use both scent and sight to hunt and were originally used to flush small game into hunters’ nets and to control village rodent populations. These days, they also make for great, loving, furry family members.",
    "height": "16 to 17 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "22 to 24 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23008_basenji-460x290.jpg"
  },
  {
    "name": "bassador",
    "description": "The Bassador is a mixed breed dog–a cross between the Basset Hound and the Labrador Retriever dog breeds. Loyal, sometimes stubborn, and always sniffing around, these pups inherited some of the best traits from both of their parents.",
    "height": "13 to 20 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "45 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/bassador-mixed-breed-dog-pictures-cover.jpg"
  },
  {
    "name": "basschshund",
    "description": "The Basschshund is a newer crossbreed composed from two older and long-beloved breeds, originating for dog parents who need a relaxed canine companion. This is a cross between the relaxed Basset Hound and the short but feisty Dachshund. For confident dog parents, this breed is sure to only keep growing loyal fans. This breed can make an amazing companion, even for those without lots of previous experience with dogs. ",
    "height": "8 to 15 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "20 to 40 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/Basschshund-1442x959.png"
  },
  {
    "name": "basset bleu de gascogne",
    "description": "A relative of the Bassett Hound, the Basset Bleu de Gascogne is an energetic working hound who loves to follow a scent. Much like the Bassett Hound, they are low to the ground and long, long, long. They have a spotted white and black coat that appears blue in some lights.",
    "height": "12 to 15 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "35 to 45 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/07/GettyImages-1254531425.jpg"
  },
  {
    "name": "basset fauve de bretagne",
    "description": "The Basset Fauve de Bretagne is a purebred dog from France. These pups are intelligent, friendly, and active, which are great qualities for a hound dog.",
    "height": "12 to 15 inches.",
    "lifeSpan": "12 to 15 years.",
    "weight": "25 to 35 pounds.",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/Basset-Fauve-de-Bretagne-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "basset hound",
    "description": "The Basset Hound dog breed was bred for hunting small game such as rabbits and is still used for this purpose in some parts of the United States. When they’re not on the trail of a bunny, they’re laid-back family friends who love kids.",
    "height": "up to 14 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "50 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23010_basset-hound-460x290.jpg"
  },
  {
    "name": "basset jack",
    "description": "The Basset Jack is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small but spunky canine companion. This is a cross between the relaxed Basset Hound and the feisty Jack Russell Terrier. For confident dog parents, this breed is sure to only keep growing loyal fans. This breed can make an amazing companion for those who have previous experience with stubborn breeds.",
    "height": "8 to 12 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "15 to 35 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/Basset-Jack-1442x950.png"
  },
  {
    "name": "basset retriever",
    "description": "The Basset Retriever is a mixed breed dog–a cross between the Basset Hound and Golden Retriever dog breeds. Friendly, affectionate, and intelligent, these pups inherited some of the best qualities from both of their parents.",
    "height": "10 to 14 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "40 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/basset-retriever-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "bassetoodle",
    "description": "The Bassetoodle is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need an intelligent yet typically easygoing companion. This is a cross between the relaxed Basset Hound and the clever Poodle. The Poodle comes in three sizes (Standard, Miniature, Toy). This article refers to the Standard Poodle cross, as it is the most common. For confident dog parents, this breed is sure to only keep growing loyal fans. ",
    "height": "12 to 16 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "45 to 75 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/10/Bassetoodle-1442x948.png"
  },
  {
    "name": "bavarian mountain scent hound",
    "description": "The Bavarian Mountain Scent Hound is a purebred dog originally from Germany. These pups are loyal, intelligent, and reserved, which are some of the best traits for a Hound dog breed.",
    "height": "17 to 20 inches.",
    "lifeSpan": "10 to 14 years.",
    "weight": "44 to 55 pounds.",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/Bavarian-Mountain-Scent-Hound-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "bea-tzu",
    "description": "The Bea-Tzu is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between the noisy but good natured Beagle and the short in stature, large in personality Shih Tzu. For confident dog parents, this breed is sure to only keep growing loyal fans. This breed can make an amazing companion for those who have previous experience with stubborn breeds.",
    "height": "11 to 15 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "15 to 23 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/bea-tzu.png"
  },
  {
    "name": "beabull",
    "description": "The Beabull is a mixed breed dog — a cross between the Beagle and the English Bulldog breeds. Loyal, curious, and loving, these pups inherited some of the best qualities from both of their parents.",
    "height": "12 to 16 inches",
    "lifeSpan": "10 to 13 years",
    "weight": "30 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/12/beabull-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "beagle",
    "description": "Small, compact, and hardy, Beagles are active companions for kids and adults alike. Canines of this dog breed are merry and fun loving, but being hounds, they can also be stubborn and require patient, creative training techniques.",
    "height": "13 to 15 inches tall at the shoulder",
    "lifeSpan": "10 to 15 years",
    "weight": "18 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23012_beagle-460x290.jpg"
  },
  {
    "name": "beaglier",
    "description": "The Beaglier is a mixed breed dog — a cross between the Beagle and Cavalier King Charles Spaniel dog breeds. Compact, energetic, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "12 to 16 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "10 to 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/beaglier-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "bearded collie",
    "description": "The Bearded Collie dog breed was developed in Scotland to herd sheep and cattle in any weather or terrain. They function today as excellent family companions, show dogs, working sheepdogs, or even all three.",
    "height": "20 to 22 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "45 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23170_bearded-collie-460x290.jpg"
  },
  {
    "name": "bedlington terrier",
    "description": "The Bedlington Terrier dog breed originated as a killer of vermin and hunter’s sidekick. Today Bedlingtons excel as companions and in the show ring. Although they still have excellent hunting instincts, a keen sense of smell, and the will to go to ground, they are rarely used in the field.",
    "height": "15 to 16 inches tall at the shoulder",
    "lifeSpan": "14 to 16 years",
    "weight": "17 to 23 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23056_bedlington-terrier-460x290.jpg"
  },
  {
    "name": "belgian laekenois",
    "description": "The Belgian Laekenois dog breed was developed in Belgium in the 1880s, herding sheep of the Laken Castle in Brussels. The rarest of the four Belgian Shepherds, the Laekenois is just starting to gain international recognition.",
    "height": "22 to 26 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "44 to 66 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/10/Belgian-Laekenois-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "belgian malinois",
    "description": "Canines of the Belgian Malinois dog breed were originally bred to be herding dogs. Today, they also work as police and military dogs, protection dogs, and loving family members.",
    "height": "22 to 26 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "40 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23172_belgian-malinois-460x290.jpg"
  },
  {
    "name": "belgian sheepdog",
    "description": "The medium-sized Belgian Sheepdog is a herding dog breed that originated in Belgium where these dogs were used to herd sheep. They later graduated to police work, and today their versatility makes them suitable for many jobs and dog sports.",
    "height": "22 to 26 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "60 to 75 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23174_belgian-sheepdog-460x290.jpg"
  },
  {
    "name": "belgian tervuren",
    "description": "Created in Belgium in the late 19th century, the Belgian Tervuren dog breed is often considered to be the most elegant of the four Belgian sheepdogs. They’re intelligent and athletic, making them a versatile performer in any number of activities, including their original job, herding.",
    "height": "21 to 26 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "40 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23176_belgian-tervuren-460x290.jpg"
  },
  {
    "name": "bergamasco sheepdog",
    "description": "An ancient breed, the Bergamasco Sheepdog was developed by shepherds as herding and guarding dogs. Today, the intelligent breed, most famous for their unique matted, mop-like coats, is known as a friendly and social companion and show dog.",
    "height": "20 to 24 inches",
    "lifeSpan": "13 to 15 years",
    "weight": "55 to 85 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/05/Bergamasco-Sheepdog-breed-pictures-cover.jpg"
  },
  {
    "name": "berger picard",
    "description": "Also known as the Picardy Shepherd, the Berger Picard dog breed is thought to be the oldest of the French sheepdogs. Their scruffy looks and lively intelligence have won them plenty of fans over the centuries, and more recently, they’ve won movie roles.",
    "height": "1 foot, 9 inches to 2 feet, 1 inch tall at the shoulder",
    "lifeSpan": "13 to 14 years",
    "weight": "50 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23290_berger-picard-460x290.jpg"
  },
  {
    "name": "bernedoodle",
    "description": "Clever, goofy, gentle, and loyal. Bernedoodle fans boast that this mixed breed has the best of both worlds from its Bernese Mountain Dog and Poodle parents.",
    "height": "from 10 to 29 inches tall at the shoulder, as sizes vary from tiny to standard",
    "lifeSpan": "12 to 18 years. tiny bernedoodles tend to live longer than standard.",
    "weight": "from 10 to 90 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2017/10/bernedoodle-dog-breed-pictures-cover-460x260.jpg"
  },
  {
    "name": "bernese mountain dog",
    "description": "The Bernese Mountain Dog is an extremely versatile working dog from the farmlands of Switzerland. They were developed to herd cattle, pull carts, and be watchdogs and loyal companions. They’re one of four types of Swiss Mountain Dogs, and the only one with long hair.",
    "height": "23 to 28 inches",
    "lifeSpan": "6 to 10 years",
    "weight": "70 to 115 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22912_bernese-mountain-dog-460x290.jpg"
  },
  {
    "name": "bichon frise",
    "description": "The Bichon Frise (pronounced BEE-shawn FREE-say; the plural is Bichons Frises) is a cheerful, small dog breed with a love of mischief and a lot of love to give. With their black eyes and fluffy white coat, the Bichon looks almost like a child’s toy.",
    "height": "9 to 11 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "7 to 12 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23136_bichon-frise-460x290.jpg"
  },
  {
    "name": "bichonaranian",
    "description": "The Bichonaranian is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the Pomeranian and the Bichon Frise. This breed is short in stature. However, they’re huge in personality, and can be a rewarding companion.",
    "height": "9 to 12 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "8 to 10 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2023/01/Bichonaranian.jpg"
  },
  {
    "name": "bidoodle",
    "description": "The Bidoodle is a crossbreed composed from two beloved breeds. They are developed for dog parents who need a small but playful companion, with the best of both their parent breeds. This is a cross between two popular breeds: the Bichon Frise and the Poodle (typically Miniature). This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "8 to 11 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "8 to 14 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/bidoodle.jpg"
  },
  {
    "name": "biewer terrier",
    "description": "The Biewer Terrier is a rare purebred dog created through the occurrence of a recessive piebald gene in two Yorkshire Terriers. These dogs are friendly, playful, and energetic, which are some of their best qualities.",
    "height": "7 to 11 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "4 to 8 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/biewer-terrier-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "black and tan coonhound",
    "description": "Born in the USA, the outgoing and friendly Black and Tan Coonhound is a versatile companion who shines in the show ring and field. At home, they’re a superb playmate, jogging or walking companion, and bed warmer.",
    "height": "23 to 27 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "75 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23014_black-and-tan-coonhound-460x290.jpg"
  },
  {
    "name": "black mouth cur",
    "description": "Energetic, fearless, and strong, the Black Mouth Cur is valued as an all-around working dog bred to help farmers and hunters in the rugged terrain of the southeastern United States.",
    "height": "16 to 25 inches",
    "lifeSpan": "12 to 18 years",
    "weight": "40 to 95 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2017/11/black-mouth-cur-dog-breed-pictures-cover-460x260.jpg"
  },
  {
    "name": "black russian terrier",
    "description": "These majestic black beauties are highly intelligent, confident guard dogs who aren’t actually true terriers. Relatively new and still a rare dog breed, the Black Russian Terrier is a working dog who can protect a home or business, play with the family’s children, and excel in agility and obedience competition.",
    "height": "26 to 28 inches at the shoulder",
    "lifeSpan": "10 to 11 years",
    "weight": "80 to 140 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22914_black-russian-terrier-460x290.jpg"
  },
  {
    "name": "bloodhound",
    "description": "The Bloodhound’s ancestors were created in medieval France to trail deer and boar. Today, this is a highly active and intelligent dog breed whose keen sense of smell has found them a special place in law enforcement and search and rescue. Their fans love them for their sweet nature and unique appearance.",
    "height": "23 to 27 inches ttall at the shoulder",
    "lifeSpan": "11 to 15 years",
    "weight": "80 to 110 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23016_bloodhound-460x290.jpg"
  },
  {
    "name": "blue lacy",
    "description": "The Blue Lacy, also called the Lacy Dog, is an energetic, intelligent, and trainable breed that loves having a job to do and a lot of open space to run around.",
    "height": "17 to 25 inches",
    "lifeSpan": "12 to 16 years",
    "weight": "25 to 50 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2018/04/blue-lacy-dog-breed-pictures-header-460x260.jpg"
  },
  {
    "name": "bluetick coonhound",
    "description": "Fast and muscular, the Bluetick Coonhound dog breed stands out for their striking coat. They have a pleasantly pleading expression and a big bawl mouth — meaning they have a long, drawn out bark. Although they’re a hunter first and foremost, the Bluetick can be a fine housedog and loves their people.",
    "height": "23 to 30 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "45 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23238_bluetick-coonhound-460x290.jpg"
  },
  {
    "name": "bocker",
    "description": "The Bocker is a mixed breed dog — a cross between the Cocker Spaniel and Beagle dog breeds. Small, affectionate, and curious by nature, these pups inherited some of the best qualities from both of their parents.",
    "height": "12 to 15 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "20 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/bocker-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "boerboel",
    "description": "At first glance, you might think the large, intimidating Boerboel would make an excellent guard dog, and you’d be correct. However, this breed is equally known for being loving, calm, and family-friendly, especially towards human children.",
    "height": "22 to 28 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "110 to 200 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2018/01/boerboel-dog-breed-pictures-cover-460x260.jpg"
  },
  {
    "name": "boglen terrier",
    "description": "The Boglen Terrier is a mixed breed dog — a cross between the Beagle and Boston Terrier dog breeds. These dogs are known to be playful, spunky, loyal, and often times, stubborn. This lovable and perky mix has proven to become quite popular among owners from various backgrounds. ",
    "height": "12 to 17 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "10 to 40 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/boglen-terrier-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "bohemian shepherd",
    "description": "The Bohemian Shepherd dog breed originated in the Czech Republic around the 1300s in the Chodsko region, hence why these dogs were commonly called the Chodský pes. They were first used as guard dogs and as herding dogs. Today, they make great family pets who will protect and watch over their humans.",
    "height": "19 to 22 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "35 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/04/Bohemian-Shepherd-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "bolognese",
    "description": "A true companion dog, the Bolognese dog breed loves to be at their family’s side. However, they also loves getting their way and can be quite crafty about it, so be careful — you could find yourself being manipulated by a ten-pound furball.",
    "height": "9 to 12 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "8 to 14 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23240_bolognese-460x290.jpg"
  },
  {
    "name": "bolonoodle",
    "description": "The Bolonoodle is a crossbreed composed from two beloved breeds. They are developed for dog parents who need a small but playful companion, with the best of both their parent breeds. This is a cross between two popular breeds: the Bolognese and the Poodle (typically Miniature). This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "10 to 12 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "6 to 12 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/bolonoodle.jpg"
  },
  {
    "name": "borador",
    "description": "The Borador is a mixed breed dog — a cross between the Border Collie and Labrador Retriever dog breeds. Outgoing, curious, and energetic, these pups inherited some of the best qualities from both of their parents.",
    "height": "19 to 24 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "40 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/borador-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "border-aussie",
    "description": "The Border-Aussie is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need an intelligent, playful companion. This is a cross between two popular breeds: the Australian Shepherd and the Border Collie. This crossbreed combines two of the most intelligent — and the most demanding — dog breeds. This breed isn’t right for everyone. However, they can make an impressive working dog or high-energy companion. ",
    "height": "12 to 18 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "25 to 40 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2023/01/border-aussie.jpg"
  },
  {
    "name": "border collie",
    "description": "The Border Collie dog breed was developed to gather and control sheep in the hilly border country between Scotland and England. They’re known for their intense stare, or “eye,” with which they control their flock. They’re dogs with unlimited energy, stamina, and working drive, all of which make them a premier herding dog; Border Collies are still used today to herd sheep on farms and ranches around the world.",
    "height": "18 to 22 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "30 to 45 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23178_border-collie-460x290.jpg"
  },
  {
    "name": "border sheepdog",
    "description": "The Border Sheepdog is a mixed breed dog — a cross between the Border Collie and Shetland Sheepdog breeds. Energetic, intelligent, and playful, these pups inherited some of the best traits from both of their parents.",
    "height": "16 to 22 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "25 to 45 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/border-sheepdog-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "border terrier",
    "description": "The alert, good-natured Border Terrier was originally bred to assist in foxhunts by driving foxes out of their hiding places and out into the open for the hounds to chase. Nowadays, they make great family members who adore their humans.",
    "height": "10 to 11 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "11 to 15 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23058_border-terrier-460x290.jpg"
  },
  {
    "name": "bordoodle",
    "description": "The Bordoodle is a mixed breed dog — a cross between the Border Collie and Poodle dog breeds. Friendly, playful, and intelligent, these pups inherited some of the best qualities from both of their parents.",
    "height": "12 to 22 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "30 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/bordoodle-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "borzoi",
    "description": "The Borzoi dog breed was developed in Russia as a coursing and hunting dog. These hounds hunted in teams of three to go after rabbit, foxes, and wolves. They later became popular as a companion for royalty across continental Europe.",
    "height": "26 to 32 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "55 to 105 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23018_borzoi-460x290.jpg"
  },
  {
    "name": "boshih",
    "description": "The BoShih is a mixed breed dog — a cross between the Shih Tzu and Boston Terrier breeds. Small, inquisitive and affectionate, these pups inherited some of the best qualities from both of their parents.",
    "height": "12 to 15 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "10 to 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/12/boshih-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "bossie",
    "description": "The Bossie is a mixed breed dog — a cross between the Boston Terrier and Australian Shepherd dog breeds. Medium in size, energetic, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "15 to 23 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "25 to 40 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/bossie-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "boston boxer",
    "description": "The Boston Boxer is a mixed breed dog–a cross between the Boston Terrier and Boxer dog breeds. Friendly, intelligent, and playful, these pups inherited some of the best traits from both of their parents.",
    "height": "15 to 23 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "22 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/boston-boxer-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "boston terrier",
    "description": "The Boston Terrier has been popular since their creation a little more than a century ago. They were originally bred to be fighting dogs, but today, they’re gentle, affectionate companions with tuxedo-like markings that earned them the nickname “American Gentleman.”",
    "height": "12 to 15 inches tall at the shoulder",
    "lifeSpan": "13 to 15 years",
    "weight": "10 to 25 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23138_boston-terrier-460x290.jpg"
  },
  {
    "name": "boston terrier pekingese mix",
    "description": "The Boston Terrier Pekingese Mix is a mixed breed dog — a cross between the Boston Terrier and Pekingese dog breeds. Compact, smart, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "10 to 15 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "10 to 25 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/05/Boston-Terrier-Pekingese-Mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "bouvier des flandres",
    "description": "The Bouvier des Flandres was originally bred to be a versatile farm dog. They helped farmers in a multitude of tasks, including herding livestock (particularly cattle), pulling carts, and guarding. The hard-working and intelligent Bouvier is still an ideal farm dog, as well as a capable service, assistance, law enforcement, and guard dog.",
    "height": "23 to 26 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "70 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23180_bouvier-des-flandres-460x290.jpg"
  },
  {
    "name": "boxador",
    "description": "The Boxador is a mixed breed of dog–a cross between the Boxer and Labrador Retriever dog breeds. Medium to large in size, intelligent, and totally devoted to their families, these pups inherited some of the best qualities from both of their parents.",
    "height": "23 to 25 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "50 to 110 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/boxador-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "boxer",
    "description": "Boxer dogs were originally bred to be medium-size guard dogs. Today, although they are a part of the AKC’s Working Group, Boxers mostly find homes as loving family companions. That said, they still retain their high energy levels and need plenty of exercise.",
    "height": "21 to 25 inches at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "60 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22916_boxer-460x290.jpg"
  },
  {
    "name": "boxerdoodle",
    "description": "The Boxerdoodle is a mixed breed dog — a cross between the Boxer and Poodle dog breeds. Friendly, smart, and playful, these pups inherited some of the best qualities from both of their parents.",
    "height": "10 to 25 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "12 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/boxerdoodle-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "boxmatian",
    "description": "The Boxmatian is a mixed breed dog — a cross between the Boxer and Dalmatian dog breeds. Playful, goofy, and protective, these pups inherited some of the best qualities from both of their parents.",
    "height": "19 to 25 inches",
    "lifeSpan": "10 to 13 years",
    "weight": "50 to 90 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/boxmatian-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "boxweiler",
    "description": "The Boxweiler is a mixed breed dog—a cross between the Boxer and Rottweiler dog breeds. Loving, loyal, and bright, these pups inherited some of the best qualities from both of their parents.",
    "height": "21 to 27 inches",
    "lifeSpan": "8 to 13 years",
    "weight": "70 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/12/boxweiler-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "boykin spaniel",
    "description": "Dogs of the Boykin Spaniel breed are known for their hunting skills, but they make just as good companions to families as to hunters, thanks to their smarts and their friendly confidence. The family should be an active one, however; this dog needs lots of exercise.",
    "height": "14 to 18 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "25 to 40 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23242_boykin-spaniel-460x290.jpg"
  },
  {
    "name": "bracco italiano",
    "description": "In their native Italy, the Bracco Italiano is known as a hunting dog breed, but they’re also gaining notice as a sweet and affectionate family companion. With their long ears, droopy lips, and soulful expression, the Bracco Italiano has a distinctive look. They’re believed to be an ancient breed, dating back to the fourth or fifth century B.C.",
    "height": "22 to 26 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "55 to 90 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/Bracco-Italiano-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "braque du bourbonnais",
    "description": "The Braque du Bourbonnais is an ancient purebred pointing dog originally from the country of France. Affectionate, calm, and intelligent, these pups have some of the best qualities of any dog breed out there today.",
    "height": "18 to 23 inches.",
    "lifeSpan": "12 to 15 years.",
    "weight": "35 to 55 pounds.",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/Braque-du-Bourbonnais-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "braque francais pyrenean",
    "description": "The Braque Francais Pyrenean dog originated in France with the purpose of working as a hunting dog. Today, people know dogs of this medium-sized breed as friendly and sociable companions.",
    "height": "18.5 to 27 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "40 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/05/Braque-Francais-Pyrenean-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "briard",
    "description": "Underneath the Briard’s long, shaggy coat lies a bold spirit and keen intelligence. True to their French roots, they can be aloof with strangers, but are affectionate and loving toward members of their pack.",
    "height": "22 to 27 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "70 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23182_briard-460x290.jpg"
  },
  {
    "name": "brittany",
    "description": "Brittanys were bred as gundogs, and they definitely have birds on the brain. Although they’re often called Brittany Spaniels, the American Kennel Club dropped the word “spaniel” from this pointing breed’s name in 1982.",
    "height": "1 foot, 5 inches to 1 foot, 8 inches tall at the shoulder",
    "lifeSpan": "10 to 13 years",
    "weight": "30 to 40 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22956_brittany-460x290.jpg"
  },
  {
    "name": "broholmer",
    "description": "The Broholmer is a large purebred dog from Denmark in northern Europe. Calm, protective, and friendly, this pup has some of the best qualities of any dog breed around!",
    "height": "22 to 30 inches.",
    "lifeSpan": "8 to 12 years.",
    "weight": "90 to 150 pounds.",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/Broholmer-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "brusselranian",
    "description": "The Brusselranian is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the Pomeranian and the Brussels Griffon. This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "10 to 12 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "8 to 11 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2023/01/Brusselranian.jpg"
  },
  {
    "name": "brussels griffon",
    "description": "Originally bred to hunt and kill rats, this former Belgian street dog is a distinctive and unusual dog breed. Although the Brussels Griffon is small, they’re hardly a pampered pooch. Affectionate and lively, their intelligence, sense of humor, and air of self-importance keep them one step ahead of their people, who adore their pups anyway.",
    "height": "7 to 8 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "7 to 12 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23098_brussels-griffon-460x290.jpg"
  },
  {
    "name": "bugg",
    "description": "The Bugg is a mixed breed dog — a cross between the Boston Terrier and Pug dog breeds. Intelligent, affectionate, and spunky, these pups inherited some of the best traits from both of their parents.",
    "height": "14 to 18 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "10 to 25 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/12/bugg-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "bull arab",
    "description": "The Bull Arab is a hybrid breed dog with ancestry linked to the English Bull Terrier, Greyhound, shorthair Pointers, and later, larger breeds like the Mastiff and Great Dane. Strong, loyal, and active, the Bull Arab inherited some of the best qualities from their lineage.",
    "height": "24 to 27 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "60 to 95 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/10/breeds-not-recognized-kennel-clubs-3.jpg"
  },
  {
    "name": "bull-pei",
    "description": "The Bull-Pei is a mixed breed dog–a cross between the Chinese Shar-Pei and English Bulldog breeds. Medium in size, loving, and loyal, these pups inherited some of the best traits from both of their parents.",
    "height": "16 to 18 inches",
    "lifeSpan": "9 to 11 years",
    "weight": "35 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/03/bull-pei-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "bull terrier",
    "description": "The Bull Terrier was originally developed in the 19th century as a fighting dog and, later, a fashionable companion for gentlemen, but these days they’re a family companion and show dog. They’re a dog breed distinguished by their long, egg-shaped head.",
    "height": "21 to 22 inches tall at the shoulder",
    "lifeSpan": "10 to 15 years",
    "weight": "35 to 75 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23060_bull-terrier-460x290.jpg"
  },
  {
    "name": "bullador",
    "description": "The Bullador is a mixed breed dog–a cross between the Labrador and English Bulldog breeds. These pups fall into the medium-to-large size range. Active and loyal, Bulladors inherited some of the best traits from both of their parents.",
    "height": "17 to 20 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "50 to 90 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/02/bullador-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "bullboxer pit",
    "description": "The Bullboxer Pit is a mixed breed dog — a cross between the Boxer and American Pit Bull Terrier dog breeds. Powerful, faithful, and energetic, these pups inherited some of the best traits from both of their parents.",
    "height": "16 to 20 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "50 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/bullboxer-pit-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "bulldog",
    "description": "The Bulldog was originally used to drive cattle to market and to compete in a bloody sport called bullbaiting. Today, they’re gentle companions who love kids.",
    "height": "12 to 15 inches tall at the shoulder",
    "lifeSpan": "8 to 12 years",
    "weight": "40 to 50 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23140_bulldog-460x290.jpg"
  },
  {
    "name": "bullmastiff",
    "description": "The Bullmastiff dog breed is a firm and fearless family guardian. While standoffish toward strangers, they’ve got a soft spot for their loved ones.",
    "height": "24 to 27 inches at the shoulder",
    "lifeSpan": "8 to 10 years",
    "weight": "100 to 130 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22918_bullmastiff-460x290.jpg"
  },
  {
    "name": "bullmatian",
    "description": "The Bullmatian is a mixed breed dog — a cross between the Bulldog and Dalmatian dog breeds. Loving, energetic, and friendly, these pups inherited some of the best qualities from both of their parents.",
    "height": "11 to 24 inches",
    "lifeSpan": "8 to 12 years",
    "weight": "41 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/bullmation-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "cairn terrier",
    "description": "The Cairn Terrier dog breed is a small working terrier developed on the Isle of Skye in Scotland. Farmers used them to rid their property of vermin, and they needed a dog with courage, tenacity, and intelligence—characteristics still found in today’s Cairn.",
    "height": "9 to 10 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "13 to 14 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23062_cairn-terrier-460x290.jpg"
  },
  {
    "name": "cairnoodle",
    "description": "The Cairnoodle is a crossbreed composed from two beloved breeds. They are developed for dog parents who need a small but playful companion, with the best of both their parent breeds. This is a cross between two popular breeds: the Cairn Terrier and the Poodle (typically Miniature). This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "10 to 15 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "13 to 20 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/cairnoodle.jpg"
  },
  {
    "name": "canaan dog",
    "description": "The Canaan Dog is a pariah dog that has survived in the desert region of Israel for thousands of years. Believed to be the dog breed that the Hebrews used in biblical times to herd and guard their flocks and encampments, some are still used by Bedouins and Druse for this purpose today.",
    "height": "19 to 24 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "35 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23184_canaan-dog-460x290.jpg"
  },
  {
    "name": "cane corso",
    "description": "The Cane Corso is a working dog who absolutely loves having a job to do. This old Italian dog breed was developed to guard property and hunt big game such as wild boar.",
    "height": "1 foot, 11 inches to 2 feet, 3 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "90 to 120 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2014/08/file_23300_cane-corso-dog-breed-460x290.jpg"
  },
  {
    "name": "cardigan welsh corgi",
    "description": "The Cardigan Welsh Corgi is the older of the two Corgi dog breeds, with dogs of this type believed to have existed in Wales for more than 3,000 years.",
    "height": "10 inches to 1 foot tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "25 to 38 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/11/file_23294_cardigan-welsh-corgi-460x290.jpg"
  },
  {
    "name": "carolina dog",
    "description": "Indigenous to the United States, the Carolina Dog is a rare, primitive dog breed and relatively new to domesticity. They are medium in size, agile, and independent; they’re also known for being very clean dogs.",
    "height": "18 to 20 inches at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "33 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/04/carolina-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "catahoula bulldog",
    "description": "The Catahoula Bulldog is a mixed breed dog–a cross between the Catahoula Leopard Dog and American Bulldog dog breeds. Agile, energetic, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "24 to 26 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "75 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/catahoula-bulldog-mixed-breed-pictures-cover.jpg"
  },
  {
    "name": "catahoula leopard dog",
    "description": "The Catahoula Leopard Dog breed has a striking appearance and a strong work ethic. They’re a tough dog, bred to work in swamps and forests, and they require a leader who is firm and consistent, with time to keep them occupied.",
    "height": "20 to 26 inches tall at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "50 to 90 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23278_catahoula-leopard-dog-460x290.jpg"
  },
  {
    "name": "caucasian shepherd dog",
    "description": "Loyal, strong, and courageous, the Caucasian Shepherd Dog is a fierce family protector. They were bred to care for flocks and defend the home against wild predators in the rough Caucasus Mountain region. They’re also known as Caucasian Mountain Dogs, Russian Bear Dogs, Baskhan (Karachay) Pariy, Caucasian Ovcharka Dogs, or just CO, and there are many variants and types.",
    "height": "24 to 34 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "80 to 220 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2018/01/caucasian-shepherd-dog-breed-pictures-cover-460x261.jpg"
  },
  {
    "name": "cav-a-jack",
    "description": "The Cav-a-Jack is a mixed breed dog–a cross between the Cavalier King Charles Spaniel and Jack Russell Terrier dog breeds. Energetic, friendly, and playful, these pups inherited some of the best qualities from both of their parents.",
    "height": "10 to 17 inches",
    "lifeSpan": "12 to 17 years",
    "weight": "13 to 18 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/10/cav-a-jack-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "cav-a-malt",
    "description": "The Cav-a-Malt is a crossbreed composed from two older and long-beloved breeds. They are developed for dog parents who need a small and playful companion, with the best of both parents’ traits. This is a cross between two popular small breeds: the Cavalier King Charles Spaniel and the Maltese. This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "8 to 11 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "8 to 14 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/Cav-A-Malt.jpg"
  },
  {
    "name": "cava-chin",
    "description": "The Cava-Chin is a crossbreed composed from two older and long-beloved breeds. They are developed for dog parents who need a small and playful companion, with the best of both parents’ traits. This is a cross between two popular small breeds: the Cavalier King Charles Spaniel and the Japanese Chin. This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "8 to 11 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "8 to 12 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/cava-chin.jpg"
  },
  {
    "name": "cava inu",
    "description": "The Cava Inu is a crossbreed composed from two older and long-beloved breeds. They are developed for dog parents who need a small and playful companion, with the best of both parents’ traits. This is a cross between two popular small breeds: the Cavalier King Charles Spaniel and the Shiba Inu. This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "12 to 14 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "15 to 20 years",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/cava-inu.jpg"
  },
  {
    "name": "cava-lon",
    "description": "The Cava-lon is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the Cavalier King Charles Spaniel and the Papillion. This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "10 to 13 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "8 to 16 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/Cava-Lon.jpg"
  },
  {
    "name": "cavachon",
    "description": "The Cavachon is a mixed breed dog–a cross between the Cavalier King Charles Spaniel and Bichon Frise dog breeds. Compact, spunky, and full of fun, these pups inherited some of the best traits from both of their parents.",
    "height": "12 to 13 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "15 to 35 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/cavachon-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "cavador",
    "description": "The Cavador is a mixed breed dog — a cross between the Cavalier King Charles Spaniel and Labrador Retriever dog breeds. Friendly, loving, and intelligent, these pups inherited some of the best qualities from both of their parents.",
    "height": "18 to 24 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "22 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/cavador-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "cavalier king charles spaniel",
    "description": "Although they’re born to be a companion, the Cavalier King Charles Spaniel dog breed retains the sporty nature of their spaniel ancestors. If they’re not sitting on a lap or getting a belly rub, nothing makes them happier than to flush a bird and then attempt to retrieve it. If you are ready to adopt one of these adorable toy pooches, we’ve got you covered. Everything you need to prepare for a Cavalier King Charles Spaniel can be found right here.",
    "height": "12 to 13 inches at the shoulder",
    "lifeSpan": "9 to 15 years",
    "weight": "13 to 18 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23100_cavalier-king-charles-spaniel-460x290.jpg"
  },
  {
    "name": "cavapom",
    "description": "The Cavapom is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the Cavalier King Charles Spaniel and the Pomeranian. This breed is short in stature but huge in personality. They can be a rewarding companion for many different lifestyles.",
    "height": "10 to 13 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "8 to 16 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/Cavapom.jpg"
  },
  {
    "name": "cavapoo",
    "description": "The Cavapoo is a mixed breed dog — a cross between the Cavalier King Charles Spaniel and Poodle dog breeds. Outgoing, playful, and curious, these pups inherit some of the best traits from both of their parents.",
    "height": "9 to 14 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "9 to 25 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/cavapoo-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "central asian shepherd dog",
    "description": "The Central Asian Shepherd Dog is a big, strong, and independent dog breed. These purebred dogs go by several other names, including Central Asian Ovtcharka, Middle Asian Ovtcharka, and Mid-Asian Shepherd. One of the oldest breeds, these pups genetics can be traced back over 5,000 years.",
    "height": "24 to 28 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "88 to 110 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/06/central-asian-shepherd-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "cesky terrier",
    "description": "The Czech native Cesky Terrier dog breed descends from the Scottish Terrier and Sealyham Terrier. The Cesky Terrier was created to hunt vermin, but with their loving personality, moderate exercise needs, and small size, they make for a great companion dog, too.",
    "height": "10 to 13 inches tall at the shoulder",
    "lifeSpan": "10 to 15 years",
    "weight": "13 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23270_cesky-terrier-dog-breed-460x290.jpg"
  },
  {
    "name": "chabrador",
    "description": "The Chabrador is a mixed breed dog–a cross between the Chow Chow and Labrador Retriever dog breeds. Loyal, friendly, and independent, these pups inherited some of the best qualities from both of their parents.",
    "height": "18 to 24 inches",
    "lifeSpan": "9 to 13 years",
    "weight": "45 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/chabrador-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "cheagle",
    "description": "The Cheagle is a mixed breed dog — a cross between the Chihuahua and Beagle dog breeds. Compact, energetic, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "9 to 14 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "9 to 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/cheagle-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "chesapeake bay retriever",
    "description": "The Chesapeake Bay Retriever dog breed originated as a water dog used to hunt and retrieve ducks in the chilly chop of Maryland’s Chesapeake Bay. The dog’s sturdy build, dense coat, stamina, and strength made them ideal for this purpose.",
    "height": "1 foot, 9 inches to 2 feet, 2 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "55 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22958_chesapeake-bay-retriever-460x290.jpg"
  },
  {
    "name": "chi chi",
    "description": "The Chi Chi is a mixed breed dog — a cross between the Chihuahua and Chinese Crested dog breeds. Small, energetic, and alert, these pups inherited some of the best qualities from both of their parents.",
    "height": "5 to 12 inches",
    "lifeSpan": "11 to 20 years",
    "weight": "4 to 11 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/chi-chi-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "chi-poo",
    "description": "The Chi-Poo is a mixed breed dog — a cross between the Chihuahua and Toy or Teacup Poodle dog breeds. Compact, energetic, and great with kids, these pups inherited some of the best qualities from both of their parents.",
    "height": "5 to 15 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "5 to 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/chi-poo-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "chigi",
    "description": "The Chigi is a mixed breed dog — a cross between the Chihuahua and Corgi dog breeds. While they may be small, they’re very alert, affectionate, and playful. These pups inherited some of the best qualities from both of their parents.",
    "height": "7 to 12 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "10 to 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/chigi-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "chihuahua",
    "description": "The Chihuahua dog breed‘s charms include their small size, big personality, and variety in coat types and colors. They’re all dog, fully capable of competing in dog sports such as agility and obedience, and are among the top ten watchdogs recommended by experts.",
    "height": "6 inches to 9 inches tall at the shoulder",
    "lifeSpan": "10 to 18 years",
    "weight": "3 to 6 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23102_chihuahua-460x290.jpg"
  },
  {
    "name": "chilier",
    "description": "The Chilier is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the Cavalier King Charles Spaniel and the Chihuahua. This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "8 to 11 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "8 to 14 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/Chilier.jpg"
  },
  {
    "name": "chinaranian",
    "description": "The Chinaranian is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the Pomeranian and the Chinese Crested. This breed is short in stature but huge in personality, and can be a rewarding companion.",
    "height": "9 to 14 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "8 to 14 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2023/01/chinaranian.jpg"
  },
  {
    "name": "chinese crested",
    "description": "You won’t find a better dog breed than the Chinese Crested to be a couch potato’s companion. They can almost read your mind and will lie in bed for hours without moving a muscle.",
    "height": "11 to 13 inches tall at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "up to 12 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23104_17524831.jpg"
  },
  {
    "name": "chinese shar-pei",
    "description": "Though the Chinese Shar-Pei is the 134th breed recognized by the American Kennel Club, the dog breed has been around for hundreds of years. They were developed to guard, hunt, herd, and later on to fight, unfortunately. Today, they’re known for their characteristic short, bristly coat, loose, wrinkled skin, and devotion to their family.",
    "height": "18 to 20 inches tall at the shoulder",
    "lifeSpan": "8 to 12 years",
    "weight": "40 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23142_chinese-shar-pei-460x290.jpg"
  },
  {
    "name": "chinook",
    "description": "Created in the White Mountains of New Hampshire, the Chinook dog breed made its name on Admiral Byrd’s first Antarctic expedition in 1928. These days they’re multipurpose dogs who are happy hiking, competing in agility and other dog sports, pulling a sled or other conveyance, and playing with the kids.",
    "height": "21 to 27 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "55 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23232_chinook-460x290.jpg"
  },
  {
    "name": "chion",
    "description": "The Chion is a mixed breed dog — a cross between the Chihuahua and Papillon dog breeds. Petite, playful, and loyal, these pups inherited some of the best qualities from both of their parents",
    "height": "5 to 11 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "4 to 11 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/chion-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "chipin",
    "description": "The Chipin is a mixed breed dog — a cross between the Chihuahua and Miniature Pinscher dog breeds. Compact, happy, and fast learners, these pups inherited some of the best qualities from both of their parents. Parental breed research can offer much insight into their temperament and behaviors.",
    "height": "8 to 12 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "5 to 15 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/chipin-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "chipoo",
    "description": "The Chipoo is a crossbreed composed from two beloved breeds. They are developed for dog parents who need a small but playful companion, with the best of both their parent breeds. This is a cross between two popular breeds: the Chihuahua and the Poodle (typically Miniature). This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "10 to 12 inches",
    "lifeSpan": "10 to 16 years",
    "weight": "6 to 12 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/chipoo.jpg"
  },
  {
    "name": "chiweenie",
    "description": "The Chiweenie is a mixed breed dog — a cross between the Chihuahua and Dachshund dog breeds. Compact, energetic, and loyal, these pups inherited some of the best traits from both of their parents.",
    "height": "6 to 10 inches",
    "lifeSpan": "12 to 16 years",
    "weight": "5 to 12 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/chiweenie-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "chorkie",
    "description": "The Chorkie is a mixed breed dog–a cross between the Chihuahua and Yorkshire Terrier dog breeds. Playful, devoted, and outgoing, these small pups inherited some of the best traits from both of their parents.",
    "height": "6 to 9 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "8 to 15 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/chorkie-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "chow chow",
    "description": "The distinctive-looking Chow Chow dog breed has a proud, independent spirit that some describe as catlike. They can be aloof — if you’re looking for a cuddle buddy, this probably isn’t the best breed for you — and downright suspicious of strangers. But for the right person, they can be a fiercely loyal companion.",
    "height": "17 to 20 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "40 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23144_chow-chow-460x290.jpg"
  },
  {
    "name": "chow shepherd",
    "description": "The Chow Shepherd is a mixed breed dog–a cross between the Chow Chow and German Shepherd dog breeds. Medium to large in size, protective, and playful, these pups inherited some of the best traits from both of their parents.",
    "height": "22 to 26 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "45 to 90 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/chow-shepherd-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "chug",
    "description": "The Chug is a mixed breed dog — a cross between the Chihuahua and the Pug. Playful, loyal, and small, the Chug has some of the best traits of both of their compact, loving parents.",
    "height": "10 to 14 inches",
    "lifeSpan": "10 to 13",
    "weight": "10 to 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/chug-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "chusky",
    "description": "The Chusky is a mixed breed dog — a cross between the Chow Chow and Siberian Husky dog breeds. Curious, headstrong, and loving, these dogs inherited some of the best qualities from both of their parents.",
    "height": "18 to 23 inches",
    "lifeSpan": "10 to 13 years",
    "weight": "40 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/chusky-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "cirneco dell’etna",
    "description": "The Cirneco dell’Etna (Pronounced “cheer-NECK-oh del et-na”) is a purebred dog from the island of Sicily. Gentle, alert, and independent, these pups have some of the best traits of any dog breed around today.",
    "height": "17 to 20 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "17 to 26 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/12/Cirneco-dellEtna-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "clumber spaniel",
    "description": "The Clumber Spaniel dog breed was originally created to find and retrieve game birds for hunters. Today, there is an effort to re-establish the Clumber Spaniel as an exceptional gundog, and many Clumber Spaniels compete in field trials.",
    "height": "1 foot, 5 inches to 1 foot, 8 inches tall at the shoulder",
    "lifeSpan": "12 to 12 years",
    "weight": "55 to 85 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22960_clumber-spaniel-460x290.jpg"
  },
  {
    "name": "cockalier",
    "description": "The Cockalier is a mixed breed dog — a cross between the Cavalier King Charles Spaniel and Cocker Spaniel dog breeds. Friendly, gentle, and intelligent, these pups inherited some of the best traits from both of their parents.",
    "height": "12 to 15 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "10 to 28 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/10/cockalier-mixed-dog-breed-picture-cover.jpg"
  },
  {
    "name": "cockapoo",
    "description": "An adorable, small dog with the personality of a big clown, the Cockapoo is perhaps the first of the “designer dogs” (not a purebred dog breed), dating back to the 1960s, rather than to just a few years ago.",
    "height": "from under 10 to over 15 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "from under 6 to over 19 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23218_cockapoo-dog-breed.jpg"
  },
  {
    "name": "cockapoochi",
    "description": "The Cockapoochi is a crossbreed composed from three older and long-beloved breeds. For dog parents who need a medium-sized and playful companion with the best of all their parent breeds, look no further. This is a cross between three popular breeds: the Cocker Spaniel, the Poodle (typically Miniature), and the Chihuahua. This breed is fairly short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "10 to 15 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "15 to 24 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/cockapoochi.jpg"
  },
  {
    "name": "cocker spaniel",
    "description": "The Cocker Spaniel is primarily a beloved companion dog breed, though they remain a capable bird dog at heart. Beautiful to look at–and labor-intensive to groom–the Cocker’s amenable, cheerful disposition also makes them a treat to have in the family.",
    "height": "1 foot, 2 inches to 1 foot, 3 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "24 to 28 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22962_cocker-spaniel-460x290.jpg"
  },
  {
    "name": "cockeranian",
    "description": "The Cockeranian is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the Pomeranian and the Cocker Spaniel. This breed is short in stature but huge in personality, and can be a rewarding companion.",
    "height": "11 to 16 inches",
    "lifeSpan": "9 to 11 years",
    "weight": "7 to 25 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2023/01/Cockeranian.jpg"
  },
  {
    "name": "collie",
    "description": "The Collie dog breed is a native of Scotland, mostly of the Highland regions but also bred in the Scottish Lowlands and northern England, where they were used primarily as a herding dog. They’re great family companions and are still capable herding dogs.",
    "height": "22 to 26 inches all at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "50 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23186_collie-460x290.jpg"
  },
  {
    "name": "corgi inu",
    "description": "The Corgi Inu is a mixed breed dog — a cross between the Shiba Inu and the Corgi dog breeds. With the adorable looks of a fox, these vigilant, affable pups inherited some of the best qualities from both of their parents.",
    "height": "9 to 15 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "17 to 27 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/corgi-inu-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "corgidor",
    "description": "The Corgidor is a mixed breed dog — a cross between the Corgi and Labrador Retriever dog breeds. Mid-sized, even tempered, and energetic, these pups inherited some of the best traits from both of their parents.",
    "height": "12 to 23 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "40 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/corgidor-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "corgipoo",
    "description": "The Corgipoo is a crossbreed composed from two beloved breeds. They are developed for dog parents who need a small but playful companion, with the best of both their parent breeds. This is a cross between two popular breeds: the Pembroke Welsh Corgi and the Poodle (typically Miniature). This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "10 to 12 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "12 to 28 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/corgipoo.jpg"
  },
  {
    "name": "corkie",
    "description": "The Corkie is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the Cairn Terrier, one of Scotland’s earliest working dogs, and the silky-coated, pleasant Yorkshire Terrier. This breed may be short in stature, but they’re huge in personality, and they can be a rewarding companion for many different lifestyles.",
    "height": "6 to 9 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "8 to 12 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/corkie.png"
  },
  {
    "name": "corman shepherd",
    "description": "The Corman Shepherd is a mixed breed dog — a cross between the Corgi and the German Shepherd Dog breeds. Loyal, courageous, and a bit stubborn, these pups inherited some of the best qualities from both of their parents.",
    "height": "12 to 15 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "20 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/corman-shepherd-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "coton de tulear",
    "description": "Sweet and cuddly with a clownish personality, the Coton de Tulear dog breed is always ready for a good time. This smart little dog with the cottony coat originated in Madagascar and is related to the Bichon Frise and the Maltese.",
    "height": "8 to 12 inches tall at the shoulder",
    "lifeSpan": "starts at 14 years",
    "weight": "8 to 13 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23230_coton-de-tulear-460x290.jpg"
  },
  {
    "name": "croatian sheepdog",
    "description": "The Croatian Sheepdog is an ancient breed, believed to be developed as far back as the 7th century CE by the Croats as herding dogs. These dogs are nearly identical to their ancient appearance today. Fans of the breed adore their intelligence and energetic disposition.",
    "height": "16 to 21 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "29 to 45 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/05/croatian-sheepdog-breed-pictures-cover.jpg"
  },
  {
    "name": "curly-coated retriever",
    "description": "Created to retrieve game from land or water, the Curly-Coated Retriever dog breed was popular with English gamekeepers, hunters, and poachers alike. Today they compete in such dog sports as field trials, agility, obedience, and flyball and have found use as therapy dogs, drug sniffing dogs, and search and rescue dogs.",
    "height": "1 foot, 11 inches to 2 feet, 3 inches tall at the shoulder",
    "lifeSpan": "9 to 12 years",
    "weight": "65 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22964_curly-coated-retriever-460x290.jpg"
  },
  {
    "name": "czechoslovakian vlcak",
    "description": "Though their founding history is fairly recent, the Czechoslovakian Vlcak is a purebred. The breed was originally an experimental cross of German Shepherds and Carpathian Wolfdogs in 1955 to create an attack dog. Still a fairly rare breed, Vlcaks nowadays often spend their time as family dogs or working dogs.",
    "height": "24 to 26 inches",
    "lifeSpan": "12 to 16 years",
    "weight": "44 to 57 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2021/03/Czechoslovakian-Vlcak-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "dachsador",
    "description": "The Dachsador is a mixed breed dog–a cross between the Dachshund and Labrador Retriever dog breeds. Lively, active, and friendly, these pups inherited some of the best qualities from both of their parents.",
    "height": "15 to 25 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "30 to 40 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/dachsador-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "dachshund",
    "description": "Dachshunds are scent hound dogs bred to hunt badgers and other tunneling animals, rabbits, and foxes. Hunters even used packs of Dachshunds to trail wild boar. Today their versatility makes them excellent family companions, show dogs, and small-game hunters.",
    "height": "8 inches to 9 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "16 to 32 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23020_dachshund-dog-breed-460x290.jpg"
  },
  {
    "name": "dalmatian",
    "description": "Best known as the star of Disney’s 101 Dalmatians, this sleek and athletic Dalmatian dog breed has a history that goes back several hundred years. They started out as a coach dog but also served in many other capacities, including hunter, firehouse dog, and circus performer.",
    "height": "19 to 24 inches tall at the shoulder",
    "lifeSpan": "13 to 16 years",
    "weight": "48 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23146_dalmatian-460x290.jpg"
  },
  {
    "name": "dameranian",
    "description": "The Dameranian is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the good-natured scenthound Dachshund and the high-strung and intelligent Pomeranian. This breed may be short in stature, but they’re huge in personality, and they can be a rewarding companion for many different lifestyles.",
    "height": "5 to 7 inches",
    "lifeSpan": "11 to 15 years",
    "weight": "8 to 10 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/dameranian.png"
  },
  {
    "name": "dandie dinmont terrier",
    "description": "Dandie Dinmont Terriers originally were bred to hunt otter and badger. Nicknamed the gentleman of the terrier family, they’re calm and reserved, yet retain their terrier tenacity and love of the hunt.",
    "height": "8 to 11 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "18 to 24 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23064_dandie-dinmont-terrier-460x290.jpg"
  },
  {
    "name": "daniff",
    "description": "The Daniff is a mixed breed dog — a cross between the English Mastiff and Great Dane dog breeds. Lovable, intelligent, and protective, these pups inherited the best qualities from both of their parents.",
    "height": "27 to 33 inches",
    "lifeSpan": "8 to 12 years",
    "weight": "115 to 190 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/daniff-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "danish-swedish farmdog",
    "description": "The Danish-Swedish Farmdog (DSF) or Dansk-svensk gårdshund dog breed is also known as Danish Pinscher. These dogs come from Denmark and southern Sweden. They traditionally lived on farms and were bred to perform several jobs, including hunting, tracking, and keeping watch.",
    "height": "12 to 15 inches",
    "lifeSpan": "11 to 13 years",
    "weight": "15 to 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/08/danish-swedish-farmdog-breed-pictures-cover.jpg"
  },
  {
    "name": "deutscher wachtelhund",
    "description": "The Deutscher Wachtelhund is a rare purebred dog originating from Germany. Friendly, intelligent, and versatile, this adorable pup has some of the best qualities you can find in any dog breed.",
    "height": "18 to 21 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "40 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/10/Deutscher-Wachtelhund-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "doberdor",
    "description": "The Doberdor is a mixed breed dog–a cross between the Doberman Pinscher and Labrador Retriever dog breeds. Intelligent, protective, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "24 to 28 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "60 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/doberdor-mixed-breed-dog-pictures-cover.jpg"
  },
  {
    "name": "doberman pinscher",
    "description": "Doberman Pinschers originated in Germany during the late 19th century, mostly bred as guard dogs. Their exact ancestry is unknown, but they’re believed to be a mixture of many dog breeds, including the Rottweiler, Black and Tan Terrier, and German Pinscher.",
    "height": "24 to 28 inches tall at the shoulder",
    "lifeSpan": "10 to 13 years",
    "weight": "60 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22920_doberman-pinscher-460x290.jpg"
  },
  {
    "name": "docker",
    "description": "The Docker is a mixed breed dog — a cross between the Dachshund and Cocker Spaniel dog breeds. They range in size from small to medium and enjoy lounging around with intervals of playtime. Fetch, hiking, or squirrel chasing would be ideal. These pups inherited some of the best qualities from both of their parents.",
    "height": "9 to 15 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "20 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/docker-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "dogo argentino",
    "description": "The Dogo Argentino, sometimes called the Argentinian Mastiff or the Argentine Dogo, is a strong, athletic, and loyal breed. They can be both fierce hunters and gentle protectors of their humans. They have a high prey drive, a strong will, and, at times, a distrust of strangers and other animals, all of which require an experienced dog owner to handle the breed.",
    "height": "23 to 27 inches",
    "lifeSpan": "9 to 15 years",
    "weight": "80 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2017/12/dogo-argentino-breed-pictures-7-460x260.jpg"
  },
  {
    "name": "dogue de bordeaux",
    "description": "This dog breed‘s most famous member co-starred with Tom Hanks in the 1989 movie, Turner and Hooch. Loyal, self-assured, and territorial, the Dogue de Bordeaux requires lots of training and socialization.",
    "height": "23 to 27 inches tall at the shoulder",
    "lifeSpan": "8 to 12 years",
    "weight": "starts at 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23252_dogue-de-bordeaux-dog-breed-460x290.jpg"
  },
  {
    "name": "dorgi",
    "description": "The Dorgi is a mixed breed dog–a cross between the Dachshund and Corgi dog breeds. Loyal, friendly, and intelligent, these pups inherited some of the best qualities from both of their parents.",
    "height": "9 to12 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "15 to 28 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/dorgi-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "dorkie",
    "description": "The Dorkie is a mixed breed dog — a cross between the Dachshund and Yorkshire Terrier. Laid-back and loyal, these pint-sized pups inherited some of the best qualities from both of their parents.",
    "height": "5 to 10 inches",
    "lifeSpan": "13 to 16 years",
    "weight": "5 to 12 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/dorkie-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "doxiepoo",
    "description": "If you were the type of kid who wasn’t afraid to choose the “mystery” flavor of candy in a bag, a Dachshund Poodle — or Doxiepoo — may be for you. While this mixed breed can have famously endless combinations of traits, they are known for being affectionate, intelligent, and playful.",
    "height": "8 to 23 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "5 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/doxiepoo-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "doxle",
    "description": "A cross between Dachshund and Beagle dog breeds, the Doxle is an adorable family watchdog. Affectionate, playful, and inquisitive, Doxles combine some of the best characteristics of both parents.",
    "height": "5 to 15 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "11 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/doxle-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "drentsche patrijshond",
    "description": "The Drentsche Patrijshond is a purebred dog hailing from the Netherlands. Intelligent, loyal, and sensitive, these pups have some of the best qualities of any dog breed.",
    "height": "21 to 25 inches",
    "lifeSpan": "11 to 14 years old",
    "weight": "40 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/10/Drentsche-Patrijshond-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "drever",
    "description": "The Drever is a purebred dog from the country of Sweden. Loyal, hardworking, and alert, these pups have some of the best qualities of any dog around.",
    "height": "12 to 16 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "35 to 40 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/drever-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "dutch shepherd",
    "description": "Originally used by shepherds in the Netherlands for all-around farm work, the Dutch Shepherd is an intelligent, highly trainable jack-of-all-trades. In modern times, they find jobs as police dogs, service animals, and family-friendly companions.",
    "height": "21 to 25 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "50 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2018/01/dutch-shepherd-dog-breed-pictures-cover-460x260.jpg"
  },
  {
    "name": "english cocker spaniel",
    "description": "The English Cocker Spaniel is a medium-size dog breed with long ears and a happy disposition. The “Cocker” in their name comes from their days of hunting woodcock in England, although English Cockers have been used to hunt many other types of birds as well.",
    "height": "1 foot, 3 inches to 1 foot, 5 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "26 to 34 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22966_english-cocker-spaniel-460x290.jpg"
  },
  {
    "name": "english foxhound",
    "description": "The English Foxhound was originally a hunting dog breed, designed to pursue foxes in the English countryside. Today they also enjoy life as a family companion and compete in the conformation ring. Many English Foxhounds also compete in Foxhound Performance Trials, which grade the dogs on their pack hunting skills.",
    "height": "25 to 27 inches tall at the shoulder",
    "lifeSpan": "10 to 13 years",
    "weight": "55 to 75 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23022_english-foxhound-460x290.jpg"
  },
  {
    "name": "english setter",
    "description": "The English Setter dog breed was named for these dogs’ practice of “setting,” or crouching low, when they found birds so hunters could throw their nets over them. After the development of the gun, breeders developed the dog so they would stand in the more traditional Pointer style.",
    "height": "1 foot, 11 inches to 2 feet, 3 inches tall at the shoulder",
    "lifeSpan": "11 to 15 years",
    "weight": "45 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22968_english-setter-460x290.jpg"
  },
  {
    "name": "english springer spaniel",
    "description": "The English Springer Spaniel dog breed was developed as a gun dog to flush, or spring, game in the field, but they’re also popular companions.",
    "height": "1 foot, 6 inches to 1 foot, 10 inches tall at the shoulder",
    "lifeSpan": "9 to 15 years",
    "weight": "45 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22970_english-springer-spaniel-460x290.jpg"
  },
  {
    "name": "english toy spaniel",
    "description": "Nicknamed “Charlies” after the king who loved them, the English Toy Spaniel dog breed is quieter and more reclusive than their Cavalier cousins, but they can have a mischievous spark. They tend to prefer a single person and are not a “hail fellow, well met” type of dog.",
    "height": "10 to 11 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "8 to 14 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23106_english-toy-spaniel-460x290.jpg"
  },
  {
    "name": "entlebucher mountain dog",
    "description": "The Entlebucher Mountain Dog has the independent spirit of other herding breeds, but still relishes spending time with their people — especially if they give this dog a job to do. They can be territorial and will bark to warn you of visitors.",
    "height": "16 to 20 inches tall at the shoulder",
    "lifeSpan": "10 to 13 years",
    "weight": "45 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23262_entlebucher-mountain-dog-460x290.jpg"
  },
  {
    "name": "eskipoo",
    "description": "The Eskipoo is a crossbreed composed from two beloved breeds. For dog parents who need a small but playful companion with the best of both their parent breeds, look no further. This is a cross between two popular breeds: the American Eskimo Dog and the Poodle (typically Miniature). This breed is huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "9 to 15 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "13 to 20 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/eskipoo.jpg"
  },
  {
    "name": "estrela mountain dog",
    "description": "The Estrela Mountain Dog is a purebred dog from the Estrela Mountains of Portugal. Courageous, protective, and loyal, these pups have some of the best qualities of most dog breeds around today.",
    "height": "24 to 30 inches",
    "lifeSpan": "11 to 15 years",
    "weight": "75 to 130 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/estrela-mountain-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "eurasier",
    "description": "The Eurasier is a breed of medium-sized dogs of the Spitz type that first came from Germany. These dogs are known to be very smart, loyal, and even-tempered.",
    "height": "20 to 24 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "40 to 71 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/eurasier-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "field spaniel",
    "description": "The sturdy, medium-sized Field Spaniel dog breed was originally developed to retrieve game from land or water. Today, while they retain their excellent hunting skills, they’re mainly family companions and show dogs and are rarely seen in the field.",
    "height": "1 foot, 4 inches to 1 foot, 7 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "37 to 45 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22972_field-spaniel-460x290.jpg"
  },
  {
    "name": "fila brasileiro",
    "description": "The Fila Brasileiro was developed in Brazil centuries ago as a large game hunting dog and working dog. These large dogs can be intimidating, but there is a reason why the saying, “faithful as a Fila” exists in Brazil.",
    "height": "24 to 30 inches",
    "lifeSpan": "9 to 12 years",
    "weight": "90 to 180 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/06/Fila-Brasileiro-dog-breed-pictures-1-1442x961.jpg"
  },
  {
    "name": "finnish lapphund",
    "description": "Believe it or not, the hard-working Finnish Lapphund dog breed earned their keep herding reindeer in their native Lapland, in the far north of Finland. Friendly and gentle, the breed retains a strong herding instinct.",
    "height": "17 to 20 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "33 to 53 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23258_finnish-lapphund-460x290.jpg"
  },
  {
    "name": "finnish spitz",
    "description": "Finnish Spitz were originally were bred to hunt a variety of small and large game, and then bark when they found something. Today they’re considered “talkative” companions who will keep you apprised of just about everything going on in your surroundings.",
    "height": "15 to 20 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "20 to 35 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23148_finnish-spitz-460x290.jpg"
  },
  {
    "name": "flat-coated retriever",
    "description": "The Flat-Coated Retriever was originally developed as a dual-purpose retriever of game on land and from water, and they’re still popular for that purpose today.",
    "height": "1 foot, 10 inches to 2 feet tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "55 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22974_flat-coated-retriever-460x290.jpg"
  },
  {
    "name": "fox terrier",
    "description": "The Fox Terrier was originally bred to flush foxes out of their hiding places during fox hunts. Today they’re primarily family companions and show dogs, although you’ll occasionally find them in the hunt country of the northeastern United States, still performing their traditional role.",
    "height": "up to 15 inches tall at the shoulder",
    "lifeSpan": "10 to 15 years",
    "weight": "15 to 19 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23094_fox-terrier-460x290.jpg"
  },
  {
    "name": "french bulldog",
    "description": "The French Bulldog has enjoyed a long history as a companion dog. Created in England to be a miniature Bulldog, they accompanied English lacemakers to France, where they acquired their “Frenchie” moniker.",
    "height": "11 to 12 inches tall at the shoulder",
    "lifeSpan": "11 to 14 years",
    "weight": "16 to 28 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23150_french-bulldog-460x290.jpg"
  },
  {
    "name": "french bullhuahua",
    "description": "The French Bullhuahua is a mixed breed dog–a cross between the Chihuahua and French Bulldog breeds. Compact, spunky, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "6 to 12 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "10 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/03/french-bullhuahua-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "french spaniel",
    "description": "The French Spaniel is a purebred dog from France and Canada. These dogs are sociable, intelligent, and gentle, which make up some of the best qualities in any pooch.",
    "height": "21 to 24 inches.",
    "lifeSpan": "10 to 12 years.",
    "weight": "45 to 60 pounds.",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/french-spaniel-dog-breed-picture-cover.jpg"
  },
  {
    "name": "frenchton",
    "description": "The Frenchton is a mixed breed dog — a cross between the Boston Terrier and French Bulldog breeds. Sturdy, sociable, playful, and chill, these pups inherited some of the best qualities from both of their parents.",
    "height": "11 to 14 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "15 to 25 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/frenchton-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "frengle",
    "description": "The Frengle is a mixed dog breed–a cross between the French Bulldog and Beagle dog breeds. Charismatic, affectionate, and even-tempered, these pups inherited some of the best qualities from both of their parents.",
    "height": "8 to 15 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "18 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/02/frengle-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "german longhaired pointer",
    "description": "The German Longhaired Pointer is a multipurpose hunting dog breed that Germans started selectively breeding for their versatility and athleticism. Today, the German Longhaired Pointer, or GLP, is a gentle, loyal breed.",
    "height": "23 to 28 inches",
    "lifeSpan": "11 to 14 years",
    "weight": "60 to 71 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/05/german-longhaired-pointer-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "german pinscher",
    "description": "The German Pinscher dog breed is muscular and agile, powerful yet graceful. A medium-sized dog with an elegant appearance, they’re admired as much for their beauty as for their intelligence.",
    "height": "17 to 20 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "25 to 45 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22922_german-pinscher-460x290.jpg"
  },
  {
    "name": "german shepherd dog",
    "description": "The German Shepherd Dog is one of America’s most popular dog breeds — for good reasons. They’re intelligent and capable working dogs. Their devotion and courage are unmatched. And they’re amazingly versatile.",
    "height": "1 foot, 10 inches to 2 feet, 2 inches tall at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "75 to 95 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23188_german-shepherd-dog-460x290.jpg"
  },
  {
    "name": "german shepherd pit bull",
    "description": "The German Shepherd Pit Bull is a mixed breed dog–a cross between the German Shepherd Dog and American Pit Bull Terrier breeds. Medium to large in size, energetic, and loyal, these pups inherited some of the best traits from both of their parents.",
    "height": "17 to 26 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "30 to 90 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/02/german-shepherd-pit-bull-mixed-dog-breed-pictures-COVER.jpg"
  },
  {
    "name": "german shepherd rottweiler mix",
    "description": "The German Shepherd Rottweiler Mix is a a cross between the German Shepherd and Rottweiler dog breeds. Eenergetic, loyal, and as eager to play as they are to snuggle, these mixed breed pups inherited some of the best qualities from both of their parents.",
    "height": "22 to 28 inches",
    "lifeSpan": "9 to 13 years",
    "weight": "75 to 115 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/04/german-shepherd-rottweiler-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "german sheprador",
    "description": "The German Sheprador is a mixed breed dog — a cross between the German Shepherd and Labrador Retriever dog breeds. Large, energetic, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "20 to 27 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "60 to 95 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/german-sheprador-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "german shorthaired pointer",
    "description": "The versatile German Shorthaired Pointer sporting dog breed hunts many types of game, retrieves on land or from water, and is an affectionate companion. They have a striking, easy-care coat, but they need plenty of vigorous exercise.",
    "height": "1 foot, 9 inches to 2 feet, 1 inch tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "45 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22976_german-shorthaired-pointer-460x290.jpg"
  },
  {
    "name": "german spitz",
    "description": "The German Spitz is one of the oldest dog breeds originating from Europe. Attentive, energetic, and devoted, these pups have some of the best qualities among any dog breed around.",
    "height": "12 to 15 inches",
    "lifeSpan": "13 to 15 years",
    "weight": "21 to 29 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/10/german-spitz-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "german wirehaired pointer",
    "description": "The German Wirehaired Pointer was developed in the late 19th and early 20th centuries to be a versatile hunting dog breed, a job at which they still excel today. They can hunt any game on any terrain and point and retrieve from land or water.",
    "height": "1 foot, 10 inches to 2 feet, 2 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "60 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22978_german-wirehaired-pointer-460x290.jpg"
  },
  {
    "name": "giant schnauzer",
    "description": "The Giant Schnauzer was created to be a working dog breed, so they have intelligence and drive. They can be a loyal and courageous companion for the person who can provide them with the training, exercise, and attention they need.",
    "height": "23 to 27 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "55 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22924_giant-schnauzer-460x290.jpg"
  },
  {
    "name": "glen of imaal terrier",
    "description": "The Glen of Imaal Terrier is a strong, independent dog breed named for the remote valley in Ireland where they originated. Bred to hunt fox and badger, and to keep homes free of rodents, the Glen is a skilled and cunning hunter. They’re also an affectionate family dog, gentle, and loving with their people.",
    "height": "12 to 14 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "up to 35 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23066_glen-of-imaal-terrier-460x290.jpg"
  },
  {
    "name": "goberian",
    "description": "The Goberian is a mixed breed dog — a cross between the Golden Retriever and Siberian Husky dog breeds. Friendly, energetic, and smart, these pups inherited some of the best qualities from both of their parents.",
    "height": "20 to 24 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "45 to 90 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/goberian-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "goldador",
    "description": "Loving, devoted, and energetic, Goldador mixed breed dogs are prized for their good-natured trainability. As a cross between the Golden Retriever and Labrador Retriever, this mix inherited some of the best traits from both purebred parents.",
    "height": "22 to 24 inches tall at the shoulder",
    "lifeSpan": "10 to 15 years",
    "weight": "60 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23214_goldador-460x290.jpg"
  },
  {
    "name": "golden cavalier",
    "description": "The Golden Cavalier is a crossbreed composed from two older and long-beloved breeds. For dog parents who need a medium-sized and playful companion with the best of both parents’ traits, look no further. This is a cross between two popular breeds: the Cavalier King Charles Spaniel and the Golden Retriever. This breed is fairly short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "16 to 18 inches",
    "lifeSpan": "9 to 12 years",
    "weight": "28 to 35 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/golden-cavalier.jpg"
  },
  {
    "name": "golden cocker retriever",
    "description": "The Golden Cocker Retriever is a mixed breed dog–a cross between the Golden Retriever and Cocker Spaniel dog breeds. Sweet, playful, and intelligent, these pups inherited some of the best qualities from both of their parents.",
    "height": "20 to 24 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "30 to 45 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/10/golden-cocker-retriever-mixed-dog-breed-pictures-cover-1.jpg"
  },
  {
    "name": "golden mountain dog",
    "description": "The Golden Mountain Dog is a mixed breed dog–a cross between the Golden Retriever and Bernese Mountain Dog breeds. Gentle, friendly and intelligent, these pups inherited some of the best qualities from both of their parents.",
    "height": "24 to 28 inches",
    "lifeSpan": "9 to 15 years",
    "weight": "75 to 120 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/10/golden-mountain-dog-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "golden mountain doodle",
    "description": "The Golden Mountain Doodle is a fun twist on the common Goldendoodle. They are developed for dog parents who need a high-energy but devoted companion. This is a cross between three popular large breeds: the Golden Retriever, the Bernese Mountain Dog and the Poodle (typically, the Standard Poodle). This crossbreed is energetic and athletic, and can keep up (or outdo you!) at many outdoor activities.",
    "height": "20 to 27 inches",
    "lifeSpan": "8 to 11 years",
    "weight": "65 to 100 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/golden-mountain-dog.jpg"
  },
  {
    "name": "golden retriever",
    "description": "The Golden Retriever is one of the most popular dog breeds in the United States. The breed’s friendly, tolerant attitude makes them great family pets, and their intelligence makes them highly capable working dogs.",
    "height": "21 to 24 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "55 to 75 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22980_golden-retriever-460x290.jpg"
  },
  {
    "name": "golden retriever corgi",
    "description": "The Golden Retriever Corgi is a mixed breed dog — a cross between the Corgi and Golden Retriever dog breeds. Loyal, silly, and active, these pups inherited some of the best qualities from both of their parents.",
    "height": "10 to 18 inches",
    "lifeSpan": "10 to 13 years",
    "weight": "30 to 75 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/golden-retriever-corgi-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "golden shepherd",
    "description": "The Golden Shepherd is a mixed breed dog–a cross between the Golden Retriever and German Shepherd dog breeds. Large, energetic, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "20 to 26 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "55 to 85 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/German-Shepherd-Golden-Retriever-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "goldendoodle",
    "description": "The Goldendoodle is a “designer dog,” a hybrid dog breed resulting from mixing the Poodle with the Golden Retriever. Like all other designer “breeds,” this Doodle is not truly a breed of its own, but is a crossbreed — and in this case, a cross that is enjoying growing popularity.",
    "height": "20 to 24 inches tall at the shoulder",
    "lifeSpan": "10 to 15 years",
    "weight": "50 to 90 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23204_goldendoodle-460x290.jpg"
  },
  {
    "name": "gollie",
    "description": "The Gollie is a mixed breed dog–a cross between the Golden Retriever and Collie dog breeds. Loving, clever, and energetic, these pups inherited some of the best qualities from both of their parents.",
    "height": "22 to 26 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "50 to 75 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/gollie-mixed-dog-breed-pictures-1-1.jpg"
  },
  {
    "name": "gordon setter",
    "description": "Originally bred to hunt pheasant and quail, Gordon Setters are still fine hunting companions and field trial competitors. Canines of this breed also compete in obedience, conformation, and agility, and they’re terrific family companion dogs.",
    "height": "1 foot, 11 inches to 2 feet, 3 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "45 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22982_gordon-setter-460x290.jpg"
  },
  {
    "name": "great dane",
    "description": "Oh, baby! A Great Dane is truly a great dog breed–large and noble, commonly referred to as a gentle giant or as the “Apollo of dogs.” Apollo is the Greek god of the sun, the brightest fixture in the sky.",
    "height": "26 to 34 inches tall at the shoulder",
    "lifeSpan": "7 to 10 years",
    "weight": "100 to 200 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22926_great-dane-460x290.jpg"
  },
  {
    "name": "great pyrenees",
    "description": "The Great Pyrenees dog breed‘s goal in life is to protect sheep, goats, livestock, people, children, grass, flowers, the moon, the lawn furniture, bird feeders, and any real or imaginary predators that may intrude on your personal space. Oh yeah, and to give, give, and give unconditional love.",
    "height": "25 to 32 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "85 to 160 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23202_great-pyrenees-460x290.jpg"
  },
  {
    "name": "greater swiss mountain dog",
    "description": "The Greater Swiss Mountain dog breed was developed to be an all-around working dog, herding cattle, pulling carts, and standing guard. These days, the Swissy enjoys life as a family pet, but because of his working heritage, he enjoys being busy.",
    "height": "23 to 28 inches tall at the shoulder",
    "lifeSpan": "7 to 9 years",
    "weight": "85 to 140 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22928_greater-swiss-mountain-dog-460x290.jpg"
  },
  {
    "name": "greyador",
    "description": "The Greyador is a mixed breed dog–a cross between the Labrador and Greyhound dog breeds. These pups fall into the medium-to-large size range. Gentle yet strong, Greyadors inherited some of the best traits from both of their parents.",
    "height": "21 to 27 inches",
    "lifeSpan": "11 to 13 years",
    "weight": "50 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/02/greyador-mixed-dog-breed-pictures-COVER.jpg"
  },
  {
    "name": "greyhound",
    "description": "Greyhounds were originally bred as hunting dogs to chase hare, foxes, and deer. Canines in this dog breed can reach speeds of 40 to 45 miles per hour, making them the Ferraris of the dog world.",
    "height": "2 feet, 1 inch to 2 feet, 6 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "50 to 85 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23024_greyhound-460x290.jpg"
  },
  {
    "name": "hamiltonstovare",
    "description": "The Hamiltonstovare is a purebred dog from Sweden. These agile, affectionate, active pups have some of the best dog qualities of any dog breed around today.",
    "height": "19 to 24 inches",
    "lifeSpan": "14 to 17 years",
    "weight": "40 to 75 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/12/Hamiltonstovare-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "hanoverian scenthound",
    "description": "The Hanoebred verian Scenthound is a purdog originating from Germany. They are loyal, independent, and calm pups who have some of the best qualities of most dog breeds around today.",
    "height": "19 to 22 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "80 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/Hanoverian-Scenthound-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "harrier",
    "description": "Harriers originally were bred to hunt hares and foxes. Today, the dog breed isn’t especially popular, but their excellent sense of smell and tireless work ethic make them a great fit for hunters.",
    "height": "19 to 21 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "45 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23026_harrier-460x290.jpg"
  },
  {
    "name": "havanese",
    "description": "The Havanese dog breed has won many admirers with their long, silky hair, expressive eyes, and cuddly size. Bred as a companion dog to the Cuban aristocracy in the 1800s, they’ve earned the nickname “Velcro dog” because they stick so closely to their owner’s side.",
    "height": "8 to 11 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "7 to 13 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23108_havanese-460x290.jpg"
  },
  {
    "name": "havapoo",
    "description": "The Havapoo is a hybrid dog breed — a cross between the Havanese and Poodle (usually, a Miniature or Toy Poodle). Affectionate, intelligent, and gentle, these small dogs are versatile for many types of families.",
    "height": "8 to 15 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "7 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/11/havapoo-hybrid-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "hokkaido",
    "description": "The Hokkaido is a purebred dog from Japan. Intelligent, alert, and devoted to their families, these pooches have qualities that make them excellent companions.",
    "height": "18 to 22 inches",
    "lifeSpan": "11 to 13 years",
    "weight": "45 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/hokkaido-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "horgi",
    "description": "The Horgi is a mixed breed dog — a cross between the Siberian Husky and Corgi dog breeds. Small, playful and full of energy, these pups inherited some of the best qualities from both of their parents.",
    "height": "12 to 15 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "20 to 50 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/horgi-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "hovawart",
    "description": "The Hovawart dog breed was developed in Germany as a guard dog, and they were also used for tracking. Today, this breed is a companion and family dog. But they also work in search and rescue and as guard dogs.",
    "height": "23 to 29 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "55 to 110 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/09/hovawart-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "huskita",
    "description": "The Huskita is a mixed breed dog — a cross between the Akita and Siberian Husky dog breeds. Large, energetic, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "22 to 25 inches",
    "lifeSpan": "10 to 13 years",
    "weight": "50 to 75 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/12/huskita-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "huskydoodle",
    "description": "The Huskydoodle is a mixed breed dog–a cross between the Siberian Husky and Poodle dog breeds. Highly intelligent, full of energy, and sociable, these pups inherited some of the best traits from both of their parents.",
    "height": "12 to 25 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "40 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/12/huskydoodle-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "ibizan hound",
    "description": "The Ibizan Hound was originally bred to hunt rabbits and small game on the Balearic island of Ibiza. Today, the Ibizan Hound dog breed is still used in that capacity in Spain and elsewhere. Ibizan Hounds also compete in lure coursing, agility, obedience, conformation, and tracking, in addition to being much-loved family companions.",
    "height": "22 to 27 inches tall at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "45 to 50 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23028_ibizan-hound-460x290.jpg"
  },
  {
    "name": "icelandic sheepdog",
    "description": "Thought to be companions to the ancient Vikings, the Icelandic Sheepdog breed was used to protect flocks, especially lambs, from birds of prey. They still retain the habit of watching the sky and barking at birds — as well as everything else they see or hear.",
    "height": "16 to 18 inchestall at the shoulder",
    "lifeSpan": "14 to 15 years",
    "weight": "20 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23274_icelandic-sheepdog-460x290.jpg"
  },
  {
    "name": "irish red and white setter",
    "description": "The Irish Red and White Setter dog breed barely escaped extinction when most breeders began focusing on the all-red varieties. Now they’re considered a separate breed from their Irish Setter cousins.",
    "height": "22 to 26 inches tall at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "50 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23254_irish-red-and-white-setter-460x290.jpg"
  },
  {
    "name": "irish setter",
    "description": "Irish Setters originated as a gundogs in their native Ireland, and the dog breed‘s popularity soon spread, thanks to the beauty of their rich mahogany coat and their enthusiasm as bird dogs.",
    "height": "2 feet, 1 inch to 2 feet, 3 inches tall at the shoulder",
    "lifeSpan": "11 to 15 years",
    "weight": "60 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22984_irish-setter-460x290.jpg"
  },
  {
    "name": "irish terrier",
    "description": "The Irish Terrier dog breed was once described as the “poor man’s sentinel, the farmer’s friend, and the gentleman’s favorite.” Rugged and stouthearted, they have the advantages of a convenient size, versatile abilities as a companion, watchdog, and vermin dispatcher, and high train-ability.",
    "height": "18 to 20 inches tall at the shoulder",
    "lifeSpan": "12 to 16 years",
    "weight": "25 to 27 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23068_irish-terrier-460x290.jpg"
  },
  {
    "name": "irish water spaniel",
    "description": "Whether they’re splashing after ducks or showing off in the agility ring, canines of the Irish Water Spaniel dog breed do everything with a sense of fun. Created in Ireland as a water retriever, they’re rare these days but make excellent companions for active and experienced dog owners, especially if they live near a body of water.",
    "height": "1 foot, 9 inches to 2 feet tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "45 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22986_irish-water-spaniel-460x290.jpg"
  },
  {
    "name": "irish wolfhound",
    "description": "The Irish Wolfhound dog breed was originally used in war to drag men off horses and chariots. They also hunted large game such as deer, boar, and wolves. Today this adaptable dog is a family companion who also competes in obedience, tracking, and lure coursing.",
    "height": "32 to 35 inches tall at the shoulder",
    "lifeSpan": "6 to 8 years",
    "weight": "115 to 180 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23030_irish-wolfhound-460x290.jpg"
  },
  {
    "name": "italian greyhound",
    "description": "The Italian Greyhound dog breed was a favorite companion of noblewomen in the Middle Ages, especially in Italy. But this small hound was more than a lapdog, having the speed, endurance, and determination to hunt small game. These days, they’re a family dog whose beauty and athleticism is admired in the show ring and in obedience, agility, and rally competitions.",
    "height": "13 to 15 inches tall at the shoulder",
    "lifeSpan": "14 to 15 years",
    "weight": "6 to 15 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23110_italian-greyhound-460x290.jpg"
  },
  {
    "name": "jack-a-poo",
    "description": "The Jack-A-Poo is mixed breed dog–a cross between the Jack Russell Terrier and Poodle dog breeds. Generally the Poodle parent is Miniature or Toy sized, as opposed to Standard. Affectionate, lively, and intelligent, Jack-A-Poos are energetic pups who make great family dogs.",
    "height": "10 to 16 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "13 to 25 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/02/jack-a-poo-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "jack chi",
    "description": "The Jack Chi is a mixed breed dog — a cross between the Jack Russell Terrier and Chihuahua dog breeds. Friendly, playful, and energetic, these pups inherited some of the best qualities from both of their parents.",
    "height": "12 to 15 inches",
    "lifeSpan": "13 to 18 years",
    "weight": "8 to 18 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/jack-chi-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "jack russell terrier",
    "description": "Developed in England some 200 years ago to hunt foxes, the Jack Russell Terrier, also known as the Parson Russell Terrier, is a lively, independent, and clever little dog. They’re charming and affectionate, but they’re also a handful to train and manage. For experienced dog parents only!",
    "height": "10 to 15 inches tall at the shoulder",
    "lifeSpan": "10 to 15 years",
    "weight": "13 to 17 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23080_jack-russell-terrier-460x290.jpg"
  },
  {
    "name": "jackabee",
    "description": "The Jackabee is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the good-natured but energetic Beagle and the high-strung and intelligent Jack Russell Terrier. This breed may be short in stature, but they’re huge in personality, and they can be a rewarding companion for many different lifestyles.",
    "height": "10 to 14 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "10 to 15 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/jackabee.png"
  },
  {
    "name": "jackaranian",
    "description": "The Jackaranian is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the Pomeranian and the Jack Russell Terrier. This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "9 to 12 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "10 to 14 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2023/01/Jackaranian.jpg"
  },
  {
    "name": "jackshund",
    "description": "The Jackshund is a mixed breed dog–a cross between the Jack Russell Terrier and Dachshund dog breeds. Affectionate, lively, and playful, these pups inherited some of the best traits from two very different parents. The mix of different personalities and appearances will make for a fun, attractive dog!",
    "height": "8 to 23 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "15 to 28 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/02/jackshund-mixed-dog-breed-pictures-COVER.jpg"
  },
  {
    "name": "jagdterrier",
    "description": "The Jagdterrier dog breed was developed in Germany to work as a hunting dog. Today this small-sized breed is known for being tenacious and smart.",
    "height": "13 to 16 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "17 to 22 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/08/jagdterrier-dog-breed-pictures-cover-1.jpg"
  },
  {
    "name": "japanese chin",
    "description": "The Japanese Chin dog breed hails from Asia, where they’ve been prized as a companion for more than a thousand years. They were a popular member of Chinese and Japanese imperial courts, and it was in Japan that their distinctive look was developed.",
    "height": "8 to 11 inches tall at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "4 to 9 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23112_japanese-chin-460x290.jpg"
  },
  {
    "name": "japanese spitz",
    "description": "The Japanese Spitz is a small family companion with the heart of a large watchdog. This breed may look similar to American Eskimo Dogs, white Pomeranians, or small Samoyeds, but Japanese Spitzes have their own lineages and hail from, as you might guess, Japan. Although the American Kennel Club does not recognize this breed, many other kennel clubs around the world accept them.",
    "height": "10 to 16 inches",
    "lifeSpan": "10 to 16 years",
    "weight": "11 to 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2018/06/japanese-spitz-dog-breed-pictures-header-460x260.jpg"
  },
  {
    "name": "korean jindo dog",
    "description": "Originating in South Korea, the Korean Jindo Dog exhibits unmatched loyalty. They are also incredibly intelligent dogs with a knack for hunting, tricks, and even agility. Fastidious and quiet indoors, they make great household pets and companions.",
    "height": "19½ to 21 inches for males and 18½ to 20 inches for females",
    "lifeSpan": "12 - 15 years",
    "weight": "35 - 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2015/08/jindo-460x271.png"
  },
  {
    "name": "kai ken",
    "description": "The Kai Ken was discovered in the mountains of Kai, right near Mt. Fuji. Believed to be one of the purest and most ancient dog breeds of Japan, this rare dog is a skilled hunter and highly intelligent. Today, advocates of the breed work tirelessly to build up the dogs’ small population, especially in the United States and Japan.",
    "height": "17 to 22 inches",
    "lifeSpan": "12 to 16 years",
    "weight": "25 to 45 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/05/kai-ken-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "kangal shepherd dog",
    "description": "The Kangal Shepherd Dog breed was developed in Turkey for the purposes of working as a livestock guardian dog. Today, people know this large-sized breed as a protective and loyal companion.",
    "height": "28 to 34 inches",
    "lifeSpan": "12to 15 years",
    "weight": "90 to 150 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/05/kangal-shepherd-dog-cover.jpg"
  },
  {
    "name": "karelian bear dog",
    "description": "The Karelian Bear Dog, called Karjalankarhukoira in the breed’s native Finland, is a strong, alert, and fearless breed that is capable of hunting or treeing small-to-large game — even aggressive game such as bears, lynxes, wild boars, wolves, and moose. It makes the list of the ten most common dog breeds in Finland, where people consider them a national treasure.",
    "height": "19 to 24 inches",
    "lifeSpan": "10 to 13 years",
    "weight": "44 to 50 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2018/04/karelian-bear-dog-header-460x260.jpg"
  },
  {
    "name": "keeshond",
    "description": "The Keeshond is an old dog breed, once a companion and watchdog on the barges and boats that traveled the canals and rivers of Holland in the 17th and 18th centuries. He’s almost exclusively a companion dog today.",
    "height": "1 foot, 4 inches to 1 foot, 7 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "35 to 45 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23152_keeshond-460x290.jpg"
  },
  {
    "name": "kerry blue terrier",
    "description": "The Kerry Blue Terrier is the quintessential working dog. They hail from County Kerry, Ireland, where they were bred to hunt small game and birds, kill rodents, and herd sheep and cattle. Intelligent and brave, they became a cherished pet as well, displaying fierce devotion to their family or pack.",
    "height": "17 to 19 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "33 to 40 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23070_kerry-blue-terrier-460x290.jpg"
  },
  {
    "name": "king shepherd",
    "description": "The King Shepherd is a hard working, loyal companion dog. Confident and strong, their huge size would be a pretty big deterrent for any would-be predator. King Shepherds are protective of their families, but they’re not aggressive dogs.",
    "height": "25 to 31 inches",
    "lifeSpan": "10 to 11 years",
    "weight": "75 to 150 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/03/king-shepherd-dog-breed-picture-cover.jpg"
  },
  {
    "name": "kishu ken",
    "description": "Almost exclusive to Japan, the Kishu Ken is an ancient dog breed once used for hunting large game like boar. Some are still used as hunting dogs, but for the most part, the modern day Kishu Ken is a family dog in Japan, and they’ve started to grow in popularity in the United States, as well.",
    "height": "17 to 22 inches",
    "lifeSpan": "9 to 13 years",
    "weight": "30 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/06/kishu-ken-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "komondor",
    "description": "Although the Komondor’s appearance might make you think they were developed to mop floors, this pooch has a long and noble heritage as a flock-guarding dog breed in their native Hungary. They still retain a strong protective instinct and will defend their family and property with their life.",
    "height": "25 to 27 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "80 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22930_komondor-460x290.jpg"
  },
  {
    "name": "kooikerhondje",
    "description": "The good-natured Kooikerhondje hunting dog breed makes an affectionate family companion. Suspected to be an ancestor of the Nova Scota Duck Tolling Retriever, they hail from Holland and were used to lure ducks into traps for hunting or tagging. They still serve as hunting dogs, but also excel at other dog sports such as flyball.",
    "height": "14 to 16 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "20 to 25 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23266_kooikerhondje-460x290.jpg"
  },
  {
    "name": "kromfohrlander",
    "description": "The Kromfohrlander has the distinction of being the only breed descended from a United States military mascot, Original Peter, who was found by US troops in France and tagged along with them into Germany, where he was eventually bred, leading to a new dog breed.",
    "height": "15 to18 inches",
    "lifeSpan": "10 to 18 years",
    "weight": "22 to 31 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2021/01/Kromfohrlander-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "kuvasz",
    "description": "The Kuvasz is a large, white, flock-guarding dog who hails from Hungary. A one-family dog, they’re protective of their people and suspicious of strangers. Dogs of this breed think for themselves and can be challenging to train.",
    "height": "26 to 30 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "70 to 115 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22932_kuvasz-460x290.jpg"
  },
  {
    "name": "kyi-leo",
    "description": "The Kyi-Leo is a mixed breed dog — a cross between the Maltese and Lhasa Apso dog breeds. Playful, lively, and sweet, these pups inherited some of the best qualities from both of their parents.",
    "height": "8 to 12 inches",
    "lifeSpan": "13 to 15 years",
    "weight": "8 to 14 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/kyi-leo-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "la pom",
    "description": "The La Pom is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the Pomeranian and the Lhasa Apso. This breed is short in stature but huge in personality, and can be a rewarding companion.",
    "height": "8 to 12 inches",
    "lifeSpan": "11 to 14 years",
    "weight": "7 to 10 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2023/01/la-pom.jpg"
  },
  {
    "name": "lab pointer",
    "description": "The Lab Pointer is a mixed breed dog — a cross between the Labrador Retriever and Pointer dog breeds. Energetic, loyal, and intelligent, these pups inherited some of the best qualities from both of their parents.",
    "height": "22 to 28 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "35 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/lab-pointer-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "labernese",
    "description": "The Labernese is a mixed breed dog — a cross between the Labrador Retriever and Bernese Mountain Dog breeds. Loving, intelligent, and friendly, these pups inherited some of the best qualities from both of their parents.",
    "height": "24 to 28 inches",
    "lifeSpan": "6 to 12 years",
    "weight": "65 to 110 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/labernese-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "labmaraner",
    "description": "The Labmaraner is a mixed breed dog — a cross between the Labrador Retriever and Weimaraner dog breeds. Intelligent, active, and friendly, these pups inherited some of the best qualities from both of their parents.",
    "height": "21 to 24 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "60 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/labmaraner-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "labrabull",
    "description": "The Labrabull is a mixed breed dog — a cross between the American Pit Bull Terrier and the Labrador Retriever dog breeds. Medium in size, energetic, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "20 to 24 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "45 to 90 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/Labrabull-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "labradane",
    "description": "The Labradane is a mixed breed dog — a cross between the Labrador Retriever and Great Dane dog breeds. Loyal, affectionate, and playful, these pups inherited some of the best qualities from both of their parents.",
    "height": "24 to 30 inches",
    "lifeSpan": "8 to 12 years",
    "weight": "100 to 180 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/labradane-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "labradoodle",
    "description": "It’s not surprising that the Labradoodle has gained such popularity so quickly. Originally developed to be hypoallergenic guide dogs, the first planned crosses of Poodles and Labrador Retrievers were arranged by the Royal Guide Dogs Association of Australia.",
    "height": "21 to 24 inches at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "50 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23220_what-is-a-labradoodle.jpg"
  },
  {
    "name": "labrador retriever",
    "description": "The Labrador Retriever was bred to be both a friendly companion and a useful working dog breed. Historically, they earned their keep as fishermen’s helpers: hauling nets, fetching ropes, and retrieving fish from the chilly North Atlantic.",
    "height": "21 to 24 inches at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "55 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22988_labrador-retriever-460x290.jpg"
  },
  {
    "name": "labrastaff",
    "description": "The Labrastaff is a mixed breed dog — a cross between the Labrador Retriever and Staffordshire Bull Terrier dog breeds. Athletic, loyal, and intelligent, these pups inherited some of the best qualities from both of their parents.",
    "height": "17 to 24 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "40 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/labrastaff-mixed-dog-breed-picture-cover.jpg"
  },
  {
    "name": "labsky",
    "description": "The Labsky is a mixed breed dog — a cross between the Labrador Retriever and Siberian Husky dog breeds. Active, smart, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "20 to 28 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "40 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/labsky-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "lagotto romagnolo",
    "description": "Lagotto Romagnolo means “lake dog from Romagna,” which is a good name for this breed, considering these dogs originally helped hunt waterfowl through the wet marshlands of Romagna in Italy.",
    "height": "14 to 19 inches",
    "lifeSpan": "14 to 17 years",
    "weight": "24 to 35 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2018/07/lagotto-romagnolo-dog-breed-pictures-header-460x260.jpg"
  },
  {
    "name": "lakeland terrier",
    "description": "Lakeland Terriers were originally bred to hunt the foxes that preyed on sheep during the lambing season in Northern England’s Lake District. Today’s Lakies, as these lively, feisty little dogs are nicknamed, are affectionate, friendly, and self-confident.",
    "height": "13 to 14 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "15 to 17 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23072_lakeland-terrier-460x290.jpg"
  },
  {
    "name": "lancashire heeler",
    "description": "The Lancashire Heeler was once used to drive livestock to market and hunt rats and rabbits at home. Now, they’re a popular companion dog breed in their native Britain.",
    "height": "10 to 12 inches tall at the shoulder",
    "lifeSpan": "9 to 14 years",
    "weight": "13 to 15 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23282_lancashire-heeler-460x290.jpg"
  },
  {
    "name": "lapponian herder",
    "description": "The Lapponian Herder dog breed originated in Finland with the purposes of working as a herding dog. Today, people know dogs of this large-sized breed as friendly and energetic companions.",
    "height": "17 to 21 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "60 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2021/05/Lapponian-Herder-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "leonberger",
    "description": "The jumbo-sized Leonberger dog breed is a mix of the Newfoundland, longhaired Saint Bernard, and Great Pyrenees.",
    "height": "25 to 31 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "120 to 170 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23272_leonberger-dog-breed.jpg"
  },
  {
    "name": "lhasa apso",
    "description": "The Lhasa Apso dog breed is originally from Tibet, where they were highly regarded watchdogs in the palaces and monasteries of their mountainous homeland. Today’s Lhasa is no longer a palace guard but primarily a family companion who loyally protects their family from danger.",
    "height": "9 to 11 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "12 to 15 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23154_lhasa-apso-460x290.jpg"
  },
  {
    "name": "lhasapoo",
    "description": "The Lhasapoo is a mixed breed dog–a cross between the Lhasa Apso and Poodle dog breeds. Protective, loyal, and playful, these pups inherited some of the best qualities from both of their parents.",
    "height": "9 to 13 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "10 to 15 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/02/lhasapoo-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "lowchen",
    "description": "The Lowchen is a toy dog breed developed as a companion dog and still finds itself in this role today. Active and smart, they do very well in dog competitions such as obedience and agility, and they surpass the expectations that many have for a family companion.",
    "height": "12 to 14 inches tall at the shoulder",
    "lifeSpan": "13 to 15 years",
    "weight": "9 to 18 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23156_lowchen-460x290.jpg"
  },
  {
    "name": "maltese",
    "description": "A gentle and fearless dog breed, the Maltese greets everyone as a friend. Their glamorous white coat gives them a look of haughty nobility, but looks can be deceiving.",
    "height": "8 to 10 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "up to 7 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23114_maltese-460x290.jpg"
  },
  {
    "name": "maltese shih tzu",
    "description": "The Maltese Shih Tzu, also known as the Mal-Shi, Malti zu, and the Malt-Tzu, is a hybrid or mixed dog breed — a cross between the Maltese and Shih Tzu breeds. Created with the same goal as Doodles — to be a small, allergy-friendly companion who doesn’t shed much — this hybrid is a sweet lapdog who likes to play with the kids.",
    "height": "from 10 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "6 to 12 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23216_maltese-shih-tzu-460x290.jpg"
  },
  {
    "name": "maltipoo",
    "description": "Not actually a dog breed per se, the Maltipoo is a popular cross of the Maltese and Poodle, known for their fun-loving and affectionate nature. Active and charming, they’ll fit into all kinds of homes: apartment or house, family with kids or elderly single.",
    "height": "8 to 14 inches tall at the shoulder",
    "lifeSpan": "10 to 13 years",
    "weight": "5 to 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23210_maltipoo-460x290.jpg"
  },
  {
    "name": "manchester terrier",
    "description": "The lively, spirited Manchester Terrier dog breed is a true terrier. Bred in Manchester, England for ratting and rabbit coursing, this dog has game and they love to show it. The Gentleman’s Terrier (as they’re known in Victorian England) is not a sparring dog but loves a good chase. This makes them a flyball and agility rock star.",
    "height": "15 to 16 inches tall at the shoulder",
    "lifeSpan": "14 to 16 years",
    "weight": "12 to 22 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23224_manchester-terrier-460x290.jpg"
  },
  {
    "name": "maremma sheepdog",
    "description": "The Maremma Sheepdog is considered an “Old World European” breed, sharing ancestry with other Eastern European livestock guardian dogs, especially mountain-dwelling dogs, like the Pyrenean Mountain Dog and Kuvasz. Maremma Sheepdogs can be traced back at least to ancient Roman times. Originally bred in Italy, they are still very popular there, and their original purpose continues on: to guard livestock.",
    "height": "23.5 to 28.5 inches",
    "lifeSpan": "11 to 13 years",
    "weight": "65 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/07/Maremma-Sheepdog-breed-pictures-cover.jpg"
  },
  {
    "name": "mastador",
    "description": "The Mastador is a mixed breed dog — a cross between the Mastiff and Labrador Retriever dog breeds. Large, energetic, and lovable, these pups inherited some of the best qualities from both of their parents.",
    "height": "28 to 36 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "85 to 160 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/mastador-mixed-dog-breed-picture-cover.jpg"
  },
  {
    "name": "mastiff",
    "description": "The Mastiff is one of the most ancient types of dog breeds. Their ancestor, the Molossus, was known 5,000 years ago. Back then, they were ferocious war dogs, very different from the benevolent behemoth that the breed is today.",
    "height": "27 to 32 inches tall at the shoulder",
    "lifeSpan": "6 to 10 years",
    "weight": "130 to 220 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22934_mastiff-460x290.jpg"
  },
  {
    "name": "mauzer",
    "description": "The Mauzer is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the extroverted and unique in appearance Miniature Schnauzer and the affable, consistently good-natured Maltese. This breed may be short in stature, but they’re huge in personality. They can be a rewarding companion for many different lifestyles.",
    "height": "10 to 12 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "15 to 20 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/mauzer.png"
  },
  {
    "name": "meagle",
    "description": "The Meagle is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the good-natured but energetic Beagle and the high-strung and intelligent Miniature Pinscher. This breed may be short in stature, but they’re huge in personality, and they can be a rewarding companion for many different lifestyles.",
    "height": "12 to 16 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "10 to 20 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/meagle.png"
  },
  {
    "name": "miniature pinscher",
    "description": "The Miniature Pinscher dog breed was originally bred in Germany to hunt vermin, primarily rats, in homes and stables. Many people think that they were developed by breeding Dobermans to progressively smaller sizes, and indeed, they look similar to Dobermans. However, the Min Pin is a distinct and much older breed.",
    "height": "10 to 12 inches tall at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "8 to 11 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23116_miniature-pinscher-460x290.jpg"
  },
  {
    "name": "miniature schnauzer",
    "description": "The Miniature Schnauzer dog breed has it all in one small package: intelligence, affection, an extroverted temperament, humor, and a personality that’s twice as big as their bodies. Throw in that walrus mustache and quivering enthusiasm, and they’ll make you laugh every day.",
    "height": "13 to 14 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "11 to 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23074_miniature-schnauzer-460x290.jpg"
  },
  {
    "name": "morkie",
    "description": "The Morkie is a mixed breed dog–a cross between the Maltese and the Yorkshire Terrier dog breeds. Small, energetic, and super silly, these pups inherited some of the best qualities from both their parents.",
    "height": "4 to 8 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "7 to 13 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/morkie-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "mountain cur",
    "description": "The Mountain Cur dog breed originated in the mountains of Kentucky and Tennessee. They were a major part of the early settlers’ lives and helped their humans while they developed farms in mountainous, rural, southern regions. They acted as watchdogs on farms, assisted with hunting, and even herded livestock. Dogs of this breed still perform those same tasks today among other jobs, including being loyal companions.",
    "height": "16 to 26 inches",
    "lifeSpan": "10 to 16 years",
    "weight": "30 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/07/mountain-cur-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "mountain feist",
    "description": "The Mountain Feist is a dog breed that was bred in the rural South of the United States of America to be a hunting dog of small vermin — specifically a “treeing dog,” which means the type of hunting dog that chases above-ground, rather than digging underground. Today, these dogs are still well-suited to this job, but they also do well with active families with ample backyards.",
    "height": "10 to 22 inches",
    "lifeSpan": "10 to 18 years",
    "weight": "10 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/12/Mountain-Feist-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "mudi",
    "description": "Alert, active, and smart, the Mudi (pronounced “moody”) is a highly trainable herding dog who can perform almost any task well. That includes watchdog duties, hunting, agility and obedience competitions, search and rescue, and more.",
    "height": "14 to 20 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "18 to 29 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2018/04/mudi-dog-breed-pictures-header-460x260.jpg"
  },
  {
    "name": "mutt (mixed)",
    "description": "A Mutt or mixed breed dog is a testament to nature. Without any input — some might say interference — from humans, the mixed breed defies description. Available in all sizes, shapes, colors, and patterns, they might have a long snout or a short nose. They may display pointed ears or floppy ones. They could have a stubby tail, spindly legs, a giant spot over their left eye — or all three.",
    "lifeSpan": "8 to 15 years",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23228_mutt-460x290.jpg"
  },
  {
    "name": "neapolitan mastiff",
    "description": "The Neapolitan Mastiff dog breed was developed in southern Italy as a family and guard dog. Today this massive breed is known as a gentle giant.",
    "height": "24 to 31 inches tall at the shoulder",
    "lifeSpan": "8 to 10 years",
    "weight": "120 to 200 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22936_neapolitan-mastiff-460x290.jpg"
  },
  {
    "name": "newfoundland",
    "description": "The Newfoundland is a large, strong dog breed from—wait for it—Newfoundland. They were originally used as a working dog to pull nets for fishermen and haul wood from the forest.",
    "height": "2 feet, 1 inch to 2 feet, 5 inches tall at the shoulder",
    "lifeSpan": "8 to 10 years",
    "weight": "100 to 150 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22938_newfoundland-460x290.jpg"
  },
  {
    "name": "newfypoo",
    "description": "The Newfypoo is a crossbreed composed from two beloved breeds. They are developed for dog parents who need a companion who can function as either a working dog or simply a dedicated and loyal pet. This is a cross between two popular large breeds: the Newfoundland and the Poodle (typically, the Standard Poodle). This breed is energetic and athletic, and can keep up (or outdo you!) at many outdoor activities.",
    "height": "25 to 30 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "80 to 160 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/newfypoo.jpg"
  },
  {
    "name": "norfolk terrier",
    "description": "The Norfolk Terrier is what’s considered a “big dog in a small package.” Alert, gregarious, and nimble, they’re a loyal companion with the heart of a working terrier.",
    "height": "9 to 10 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "11 to 12 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23076_norfolk-terrier-460x290.jpg"
  },
  {
    "name": "northern inuit dog",
    "description": "The Northern Inuit Dog is a hybrid breed with a debated background, but most agree that the Husky, Malamute, and German Shepherd Dog are part of their ancestry. Other theories include Samoyeds and Canadian Eskimo Dogs.  Though their origin is a mix, they’re now only bred with other Northern Inuit Dogs by breeders seeking to secure purebred status for this hybrid. Calm, friendly, and intelligent, these dogs may be a great addition to your family.",
    "height": "23 to 32 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "55 to 110 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/07/northern-inuit-dog-hybrid-breed-pictures-cover.jpg"
  },
  {
    "name": "norwegian buhund",
    "description": "Intelligent, independent, and eager to please, the Norwegian Buhund dog breed can handle all kinds of dog jobs and sports with ease. They need lots of exercise and attention, and they’re quick learners.",
    "height": "16 to 18 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "26 to 40 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23284_norwegian-buhund-460x290.jpg"
  },
  {
    "name": "norwegian elkhound",
    "description": "The gorgeous Norwegian Elkhound dog breed, with their wolf-like face, delights in life. Smart as can be, they also have a wonderful sense of humor. They’ll race you around the kitchen island, reverse directions when you do, and then howl for sheer fun.",
    "height": "19 to 20 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23032_norwegian-elkhound-460x290.jpg"
  },
  {
    "name": "norwegian lundehund",
    "description": "With six toes on each foot — all of them double- or triple-jointed — and an amazing range of motion, the agile Norwegian Lundehund dog breed was used to scale cliffs and rob puffin nests of their eggs.",
    "height": "1 foot to 1 foot, 3 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "13 to 16 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23276_norwegian-lundehund-460x290.jpg"
  },
  {
    "name": "norwich terrier",
    "description": "The Norwich Terrier originated as a ratter on farms but moved up in the world to bolt foxes from their dens during hunts. Today, they’re amusing companions who serve double duty by keeping your home and yard free of rats and other vermin.",
    "height": "up to 10 inches tall at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "up to 12 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23078_norwich-terrier-460x290.jpg"
  },
  {
    "name": "nova scotia duck tolling retriever",
    "description": "The Nova Scotia Duck Tolling Retriever dog breed was created to both lure and retrieve waterfowl. This versatile breed excels in the field and show ring, in obedience and agility, and as a companion to an active family.",
    "height": "1 foot, 5 inches to 1 foot, 9 inches tall at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "35 to 50 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22990_nova-scotia-duck-tolling-retriever-460x290.jpg"
  },
  {
    "name": "old english sheepdog",
    "description": "The Old English Sheepdog is a large, athletic dog breed with an unmistakable shaggy coat. The OES, as fans call the breed for short, was historically a drover, helping farmers drive cattle and sheep to the market. Today, this good-natured dog enjoys the comfort of home life and still competes in conformation, obedience, agility, and herding trials.",
    "height": "from 21 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23190_old-english-sheepdog-460x290.jpg"
  },
  {
    "name": "otterhound",
    "description": "The large and rough-coated Otterhound was originally bred for hunting otter in England. Built for work, the dog breed has a keen nose and renowned stamina.",
    "height": "24 to 27 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23034_otterhound-460x290.jpg"
  },
  {
    "name": "papillon",
    "description": "The Papillon dog breed descends from the toy spaniels that are frequently portrayed in paintings by the Old Masters, from as far back as the 16th century. They’re highly active and wonderful competitors in agility and obedience.",
    "height": "8 to 11 inches tall at the shoulder",
    "lifeSpan": "12 to 16 years",
    "weight": "4 to 9 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23118_papillon-460x290.jpg"
  },
  {
    "name": "papipoo",
    "description": "The Papipoo is a mixed breed dog — a cross between the Papillon and Poodle dog breeds. Loving, intelligent, and active, this devoted, little dog wants to be part of all family activities.",
    "height": "10 to 11 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "6 to 14 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/papipoo-mixed-dog-breed-pictures-cover-1.jpg"
  },
  {
    "name": "patterdale terrier",
    "description": "The spunky and energetic Patterdale Terrier is a very popular dog in the United States but originated in the United Kingdom. Compact, confident, and independent, this beloved dog was originally bred to hunt foxes and rabbits.",
    "height": "12 to 15 inches",
    "lifeSpan": "11 to 14 years",
    "weight": "11 to 13 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/07/patterdale-terrier-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "peekapoo",
    "description": "A Peekapoo is hybrid dog breed — a cross between the Pekingese and Poodle breeds. The mix makes for a wonderful companion dog who will spend their days perched on your lap or sitting by your side.",
    "height": "up to 11 inches tall at the shoulder",
    "lifeSpan": "10 to 15 years",
    "weight": "4 to 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23222_peekapoo-460x290.jpg"
  },
  {
    "name": "pekalier",
    "description": "The Pekalier is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the Cavalier King Charles Spaniel and the Pekingese. This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "10 to 12 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "8 to 14 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/Pekalier.jpg"
  },
  {
    "name": "pekingese",
    "description": "Pekingese dogs were bred for centuries to be the cherished companions of the imperial family of China. Today they’re still cherished family companions and show dogs who greet everyone they meet with dignity and grace.",
    "height": "6 to 9 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "7 to 14 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23120_pekingese-460x290.jpg"
  },
  {
    "name": "pembroke welsh corgi",
    "description": "Originally bred to herd cattle, sheep, and horses, the Pembroke Welsh Corgi is an active and intelligent dog breed. Easy to train and eager to learn, Pembrokes are great with children and other pets, and you can find them in four different coat colors and markings.",
    "height": "10 to 12 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "up to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23192_pembroke-welsh-corgi-460x290.jpg"
  },
  {
    "name": "perro de presa canario",
    "description": "The Perro de Presa Canario dog breed originated in the Canary Islands where they helped work with livestock. Today, people know dogs of this large-sized breed as strong and protective guardians.",
    "height": "21 to 26 inches",
    "lifeSpan": "9 to 12 years",
    "weight": "80 to 130 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/05/Perro-de-Presa-Canario-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "petit basset griffon vendéen",
    "description": "The Petit Basset Griffon Vendéen is a small scent hound who has won the hearts of millions. Although the dog breed appears to be designed for winsome cuteness, in actuality, PBGVs are tough hunters who were developed for a specific purpose: to hunt small game in the rough terrain of the Vendeen region of France. The breed is known for a merry and outgoing personality.",
    "height": "13 to 15 inches tall at the shoulder",
    "lifeSpan": "starts at 14 years",
    "weight": "30 to 40 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23036_petit-basset-griffon-vendeen-460x290.jpg"
  },
  {
    "name": "pharaoh hound",
    "description": "The Pharaoh Hound is an ancient dog breed that’s changed little since their development more than 5,000 years ago. They were the dogs of kings and may have hunted gazelles with pharaohs, hence their name. This loyal hunting companion later made their way to Malta, where they’re now the national dog.",
    "height": "21 to 25 inches tall at the shoulder",
    "lifeSpan": "11 to 14 years",
    "weight": "45 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23038_pharaoh-hound-460x290.jpg"
  },
  {
    "name": "pitsky",
    "description": "The Pitsky is a mixed breed dog — a cross between the American Pit Bull Terrier and Siberian Husky dog breeds. They range in size from medium to large, they are energetic, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "16 to 25 inches",
    "lifeSpan": "12 to 16 years",
    "weight": "30 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/pitsky-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "plott",
    "description": "The pack-hunting Plott dog breed was developed in North Carolina more than 200 years ago to hunt bear and wild boar. They are still used as hunting dogs today and have proven their worth as pack hunters. They also participate in tracking and other dog sports.",
    "height": "20 to 27 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "40 to 75 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23040_plott-460x290.jpg"
  },
  {
    "name": "pocket beagle",
    "description": "Smaller than the average Beagle dog breed, these compact scenthounds are merry and fun-loving. But the Pocket Beagle is still a hound and, as such, requires patience and creative training techniques to overcome their sometimes stubborn nature.",
    "height": "7 to 12 inches tall at the shoulder",
    "lifeSpan": "starts at 10 years",
    "weight": "7 to 15 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23234_pocket-beagle-460x290.jpg"
  },
  {
    "name": "pointer",
    "description": "Bred for several hundred years to “point” birds and small game such as rabbits, the Pointer is a versatile field dog and exceptional family dog breed. They excel in many arenas, from the field to the show ring, agility to obedience.",
    "height": "1 foot, 11 inches to 2 feet, 4 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "45 to 75 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22992_pointer-460x290.jpg"
  },
  {
    "name": "polish lowland sheepdog",
    "description": "Originally bred for herding and guarding, the Polish Lowland Sheepdog is still an excellent working dog breed. They’re obedient and fearless, good-natured with people and other dogs, but highly protective of their flock.",
    "height": "17 to 20 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "35 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23194_polish-lowland-sheepdog-460x290.jpg"
  },
  {
    "name": "pomanauze",
    "description": "The Pomanauze is a newer crossbreed composed from two older and long-beloved breeds. For dog parents who need a small and playful companion, this breed mix fits the bill. This is a cross between two popular small breeds: the extroverted and unique in appearance Miniature Schnauzer and the good-natured but determined Pomeranian. This breed may be short in stature, but they’re huge in personality. They can also be a rewarding companion for many different lifestyles.",
    "height": "8 to 12 inches",
    "lifeSpan": "11 to 15 years",
    "weight": "14 to 18 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/IMG_0995.jpeg"
  },
  {
    "name": "pomapoo",
    "description": "The Pomapoo is a mixed breed dog — a cross between the Pomeranian and Toy Poodle dog breeds. Compact, intelligent, and affectionate, these pups inherited some of the best qualities from both of their parents.",
    "height": "8 to 10 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "5 to 15 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/pomapoo-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "pomchi",
    "description": "The Pomchi is a mixed-breed dog — a cross between the Pomeranian and the Chihuahua dog breeds. Playful, devoted, and energetic, these small pups inherited some of the best qualities from both of their parents.",
    "height": "6 to 10 inches",
    "lifeSpan": "12 to 18 years",
    "weight": "4 to 12 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/pomchi-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "pomeagle",
    "description": "The Pomeagle is a mixed breed dog — a cross between the Pomeranian and Beagle dog breeds. Small, affectionate, and curious by nature, these pups inherited some of the best qualities from both of their parents.",
    "height": "6 to 11 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "5 to 25 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/pomeagle-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "pomeranian",
    "description": "Descended from large sled dog breeds, the now-tiny Pomeranian has a long and interesting history. The foxy-faced dog, nicknamed “the little dog who thinks he can,” is compact, active, and capable of competing in agility and obedience or simply being a family friend.",
    "height": "7 to 12 inches tall at the shoulder",
    "lifeSpan": "12 to 16 years",
    "weight": "3 to 7 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23122_pomeranian-460x290.jpg"
  },
  {
    "name": "pomeranian cockapoo",
    "description": "The Pomeranian Cockapoo is a crossbreed composed from three deservingly beloved breeds. For dog parents who need a medium-sized and playful companion with the best of all their parent breeds, look no further. This is a cross between three popular breeds: the Cocker Spaniel, the Poodle, and the Pomeranian. This breed is short in stature while unquestionably big in personality, and can be rewarding companions.",
    "height": "12 to 15 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "15 to 25 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/pomeranian-cockapoo.jpg"
  },
  {
    "name": "pomerdog",
    "description": "The Pomerdog is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the Pomeranian and the French Bulldog. This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "9 to 12 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "6 to 11 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2023/01/Pomerdog.jpg"
  },
  {
    "name": "pomsky",
    "description": "Cute, silly, and suited for apartment life, the Pomsky is a dog who likes to be the center of attention, and with their adorable looks and playful antics, they often get the adoration they crave.",
    "height": "10 to 15 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "7 to 38 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2017/10/pomsky-dog-breed-pictures-header-460x260.jpg"
  },
  {
    "name": "poochon",
    "description": "The Poochon is a mixed breed dog–a cross between the Toy Poodle and Bichon Frise dog breeds. Small, happy, and intelligent, these pups inherited some of the best qualities from both of their parents. Researching their parents can offer much insight into their personalities and characteristics.",
    "height": "9 to 15 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "6 to 17 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/poochon-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "poodle",
    "description": "Elegant. Proud. Clever. The Poodle is an impressive dog, as the many best-in-show winners from this dog breed can attest. But behind the blue ribbons, impressive hairdos, and regal attitude, you’ll find an affectionate family dog with an ancient history and many talents.",
    "height": "from 10 to over 22 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "6 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23200_poodle-460x290.jpg"
  },
  {
    "name": "poogle",
    "description": "The Poogle is a crossbreed composed from two beloved breeds. They are developed for dog parents who need a small but playful companion, with the best of both their parent breeds. This is a cross between two popular breeds: the Beagle and the Poodle (typically Miniature). This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "8 to 14 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "12 to 25 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/poogle.jpg"
  },
  {
    "name": "porcelaine",
    "description": "The Porcelaine dog breed originated in France where they generally performed as hunting dogs. Today, people know dogs of this large-sized breed as energetic and sociable companions.",
    "height": "21.5 to 23.5 inches",
    "lifeSpan": "12 to 13 years",
    "weight": "55 to 62 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/05/Porcelaine-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "porkie",
    "description": "The Porkie is a newer crossbreed composed of two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two of the most popular toy breeds: the Yorkshire Terrier and the Pomeranian. This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "6 to 10 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "3 to 8 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/GettyImages-513834332.jpg"
  },
  {
    "name": "portuguese podengo pequeno",
    "description": "The Portuguese Podengo Pequeno is a purebred dog from Portugal and is the smallest of the three Portuguese Podengo size classes that are not interbred. Alert, lively, and playful, these pooches are a compact-but-charming bunch to be around.",
    "height": "8 to 12 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "9 to 13 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/Portuguese-Podengo-Pequeno-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "portuguese pointer",
    "description": "The Portuguese Pointer is a dog breed from the Iberian Peninsula of Portugal, and their origins date all the way back to the 12th century. Officially classified as a sporting dog, they also fit into the bird dog categories. Originally bred for falconry work with the royals, the Portuguese Pointer is a versatile dog and is also considered by many to be the ultimate gun dog.",
    "height": "20 to 22 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "35 to 59 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/07/portuguese-pointer-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "portuguese sheepdog",
    "description": "In Portugal, people call the Portuguese Sheepdog “cão da Serra de Aires,” which is the name of a mountain range in the breed’s native land.  They’re also nicknamed “cão macaco,” which translates to “monkey dog,” due to the breed’s habit for making quizzical expressions that remind people of monkeys.",
    "height": "16 to 22 inches",
    "lifeSpan": "12 to 13 years",
    "weight": "37 to 59 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/07/portuguese-sheepdog-breed-pictures-cover.jpg"
  },
  {
    "name": "portuguese water dog",
    "description": "Portuguese Water Dogs once served as crew on fishing trips, retrieving lost gear and herding fish into nets.",
    "height": "1 foot, 5 inches to 1 foot, 11 inches tall at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "35 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22940_portuguese-water-dog-460x290.jpg"
  },
  {
    "name": "pudelpointer",
    "description": "The Pudelpointer was developed in the late 1800s to be the perfect hunting dog by combining the German Hunting Poodle, or Pudel, with an English Pointer.",
    "height": "21 to 27 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "40 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/09/pudelpointer-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "pug",
    "description": "The Pug is often described as a lot of dog in a small space. These sturdy, compact dogs are a part of the American Kennel Club’s Toy group, and are known as the clowns of the canine world because they have a great sense of humor and like to show off.",
    "height": "10 to 14 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "14 to 18 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23124_pug-460x290.jpg"
  },
  {
    "name": "pugalier",
    "description": "The Pugalier is a mixed breed dog — a cross between the Pug and Cavalier King Charles Spaniel dog breeds. Small, adorable, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "10 to 14 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "10 to 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/pugalier-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "puggat",
    "description": "The Puggat is a newer crossbreed composed from two older and long-beloved breeds, developed for dog parents who need a small and playful companion. This is a cross between two popular small breeds: the American Rat Terrier and the Pug. This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "10 to 16 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "12 to 20 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/puggat.png"
  },
  {
    "name": "puggle",
    "description": "The Puggle is a hybrid or mixed breed dog — a cross between the Beagle and Pug breeds. They’ve become fairly popular, thanks to their fun-loving personality and cute looks.",
    "height": "13 to 15 inches tall at the shoulder",
    "lifeSpan": "10 to 15 years",
    "weight": "18 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23212_puggle-460x290.jpg"
  },
  {
    "name": "puginese",
    "description": "The Puginese is a mixed breed dog–a cross between the Pug and Pekingese dog breeds. Affectionate, sensitive, and independent, these pups inherited some of the best traits from both of their parents.",
    "height": "6 to 14 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "7 to 18 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/03/puginese-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "puli",
    "description": "Best known for their long, corded coat resembling dreadlocks, the Puli is a hardworking herding dog and family companion. Energetic and lively, this mop-like dog breed hailing from Hungary appears much larger than they are due to that distinctive coat.",
    "height": "16 to 17 inches tall at the shoulder",
    "lifeSpan": "10 to 15 years",
    "weight": "25 to 35 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23196_puli-460x290.jpg"
  },
  {
    "name": "pyredoodle",
    "description": "The Pyredoodle is a mixed breed dog–a cross between the Great Pyrenees and Standard Poodle dog breeds. Calm, fearless, and loyal, these pups inherited some of the best traits from both of their parents.",
    "height": "15 to 32 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "85 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/03/pyredoodle-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "pyrenean mastiff",
    "description": "The Pyrenean Mastiff, also known as Mastín del Pirineo, comes from northeastern Spain. The exact origin of the breed is unknown, but it is speculated to have evolved from Molossers. Humans relied on them to be guardians and protectors of livestock.",
    "height": "24 to 31 inches",
    "lifeSpan": "10 to 13 years",
    "weight": "130 to 200 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/08/Pyrenean-Mastiff-Dog-Breed-Pictures-cover.jpg"
  },
  {
    "name": "pyrenean shepherd",
    "description": "These lean but muscular dogs have breathtaking speed, grace, and intelligence. The Pyrenean Shepherd’s passion for their family is matched only by their passion for work, and parents of this dog breed should be prepared to give their dogs a job to do, whether it’s a competitive dog sport or a flock of sheep to boss around.",
    "height": "15 to 21 inches tall at the shoulder",
    "lifeSpan": "15 to 17 years",
    "weight": "25 to 30 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23246_pyrenean-shepherd-460x290.jpg"
  },
  {
    "name": "rafeiro do alentejo",
    "description": "The Rafeiro do Alentejo dog breed originated in Portugal where they served as hunting and guardian dogs. Today, people know dogs of this large-sized breed as strong and confident protectors.",
    "height": "25 to 29 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "77 to 132 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/05/Rafeiro-do-Alentejo-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "rat terrier",
    "description": "Members of the Rat Terrier dog breed are adorable, little, digging escape artists who are true terriers: feisty, funny, energetic, lively, vermin-chasing, and incapable of being boring. Stubborn as all get out, they are not big on pleasing people, but the people who love them laugh all the time.",
    "height": "13 to 16 inches tall at the shoulder",
    "lifeSpan": "13 to 18 years",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23226_rat-terrier-dog-breed.jpg"
  },
  {
    "name": "redbone coonhound",
    "description": "The Redbone Coonhound dog breed is a medium-sized hound who has a gorgeous red coat, the pleading expression common to hounds everywhere, and a sweet voice that sings out when they’re on the hunt. However, they also bark a lot when they’re not on the hunt, and take a lot of patience to train.",
    "height": "21 to 27 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "45 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23248_redbone-coonhound-460x290.jpg"
  },
  {
    "name": "rhodesian ridgeback",
    "description": "The handsome Rhodesian Ridgeback dog breed was created in Africa to be a versatile hunter and home guardian. These days, They’re less likely to hunt lions and more likely to hunt a soft spot on the sofa after going jogging with you.",
    "height": "24 to 27 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "70 to 85 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23042_rhodesian-ridgeback-460x290.jpg"
  },
  {
    "name": "romanian mioritic shepherd dog",
    "description": "The Romanian Mioritic Shepherd Dog dog breed originated in Romania with the purpose of working as a livestock guardian in the mountain regions. Today, people know dogs of this large-sized breed as loyal and intelligent companions.",
    "height": "22.5 to 29 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "100 to 150 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/05/Romanian-Mioritic-Shepherd-Dog-breed-pictures-cover.jpg"
  },
  {
    "name": "rottador",
    "description": "The Rottador is a mixed breed dog–a cross between the Rottweiler and Labrador Retriever dog breeds. Large, energetic, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "24 to 27 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "70 to 115 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/rottador-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "rottle",
    "description": "The Rottle is a mixed breed dog — a cross between the Rottweiler and Poodle dog breeds. Playful, intelligent, and eager to please, these pups inherited some of the best qualities from both of their parents.",
    "height": "12 to 27 inches",
    "lifeSpan": "9 to 15 years",
    "weight": "60 to 90 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/12/rottle-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "rottweiler",
    "description": "The Rottweiler was originally dogs bred to drive cattle to market. Later they were used to pull carts for butchers. They were among the earliest police dogs and serve with honor in the military.",
    "height": "22 to 27 inches tall at the shoulder",
    "lifeSpan": "8 to 11 years",
    "weight": "85 to 130 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22942_rottweiler-460x290.jpg"
  },
  {
    "name": "russian toy",
    "description": "As its name suggests, the Russian Toy, also known as the Russkiy Toy, is a small dog breed originating from Russia. This breed is fairly new to dog fanciers outside of its country of origin, and has just recently been recognized by the AKC. This is one of the smallest dog breeds in the world. They are also found in two varieties: short-haired and long-haired. Long-haired individuals are known for the feathered fur on their ears and tail. This breed has four possible coat colors: solid red, black and tan, blue and tan, and brown and tan. ",
    "height": "7 to 11 inches",
    "lifeSpan": "10-12 years",
    "weight": "3 to 6 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/07/GettyImages-465509142.jpg"
  },
  {
    "name": "russian tsvetnaya bolonka",
    "description": "The Russian Tsvetnaya Bolonka is as small as their name is large. This toy dog was originated exclusively in Russia as a companion dog throughout the 1800s, then throughout Europe after the 1960s and the US in 2000. Their role as a lapdog has remained consistent throughout the breed’s history.",
    "height": "7 to 11 inches",
    "lifeSpan": "12 to 16 years",
    "weight": "4.5 to 11 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/04/Russian-Tsvetnaya-Bolonka-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "saint berdoodle",
    "description": "The Saint Berdoodle is a mixed breed dog — a cross between the Saint Bernard and Poodle dog breeds. Friendly, intelligent, and loyal, Saint Berdoodles are great family dogs.",
    "height": "15 to 30 inches",
    "lifeSpan": "8 to 12 years",
    "weight": "40 to 180 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/saint-berdoodle-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "saint bernard",
    "description": "Originally the Saint Bernard dog breed guarded the grounds of Switzerland’s Hospice Saint Bernard as well as to help find and save lost and injured travelers.",
    "height": "2 feet, 2 inches to 2 feet, 6 inches tall at the shoulder",
    "lifeSpan": "8 to 10 years",
    "weight": "120 to 180 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22944_saint-bernard-460x290.jpg"
  },
  {
    "name": "saluki",
    "description": "One of the oldest of dog breeds, Salukis were once considered a gift from Allah. They’re fast as the wind, skinny as a supermodel, and quietly devoted to their people.",
    "height": "23 to 28 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "35 to 70 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23044_saluki-460x290.jpg"
  },
  {
    "name": "samoyed",
    "description": "Originally bred to hunt, haul sledges, and herd reindeer, the Samoyed dog breed proved a valuable companion for northwestern Siberia’s Samoyede people. Among the breed’s duties: pack hiking, tracking, and warming their owners by sleeping on top of them at night.",
    "height": "1 foot, 7 inches to 2 feet tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "50 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22946_Samoyed-dog-breed.jpg"
  },
  {
    "name": "samusky",
    "description": "The Samusky is a mixed breed dog–a cross between the Samoyed and the Siberian Husky dog breeds. Highly intelligent, loyal, and good-natured, these pups inherited some of the best qualities from both of their parents.",
    "height": "20 to 24 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "45 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/12/samusky-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "schapendoes",
    "description": "Schapendoes rose to great popularity in the Netherlands as sheep-herding dogs. However, outside of the Netherlands, they are not very well-known, and their numbers declined greatly during World War II, along with other European sheepdogs.",
    "height": "16 to 20 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "26 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/10/Schapendoes-dog-breed-picture-cover.jpg"
  },
  {
    "name": "schipperke",
    "description": "Curious and clever, the Schipperke dog breed is often nicknamed LBD, for little black devil. They’re fearless and devoted, always on guard to protect their family from harm.",
    "height": "10 to 15 inches tall at the shoulder",
    "lifeSpan": "13 to 15 years",
    "weight": "11 to 18 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23158_schipperke-460x290.jpg"
  },
  {
    "name": "schnocker",
    "description": "The Schnocker is a mixed breed dog. They are a cross between the Miniature Schnauzer and Cocker Spaniel dog breeds. Excitable, affectionate and sweet, these pups inherited some of the best qualities from both of their parents.",
    "height": "12 to 15 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "13 to 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/06/GettyImages-1356487156.jpg"
  },
  {
    "name": "schnoodle",
    "description": "What a pistol! Smart, active, and adorable, the Schnoodle has become a popular hybrid dog breed. They’re a cross between the Poodle and the Schnauzer and can be found in many colors.",
    "height": "10 to 26 inches tall at the shoulder",
    "lifeSpan": "10 to 15 years",
    "weight": "20 to 75 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23206_schnoodle-460x290.jpg"
  },
  {
    "name": "scoodle",
    "description": "The Scoodle is a crossbreed composed from two beloved breeds. They are developed for dog parents who need a small but playful companion, with the best of both their parent breeds. This is a cross between two popular breeds: the Scottish Terrier and the Poodle (typically Miniature). This breed is short in stature but huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "7 to 11 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "9 to 18 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/scoodle.jpg"
  },
  {
    "name": "scottish deerhound",
    "description": "The original purpose of the Scottish Deerhound dog breed was to hunt and bring down the Scottish roe deer, a magnificent beast twice or more the dog’s size. Today, if the Scottish Deerhound were writing a personals ad, they’d say that they enjoy long walks, opportunities to run, regular meals, and a nice sofa to nap on.",
    "height": "28 to 32 inches tall at the shoulder",
    "lifeSpan": "8 to 11 years",
    "weight": "75 to 110 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23046_scottish-deerhound-460x290.jpg"
  },
  {
    "name": "scottish terrier",
    "description": "An independent and stubborn character, the Scottish Terrier dog breed is also quite sensitive to praise and blame. Independent, intelligent, and hilarious in their dignified seriousness, they’re a true terrier, which makes them an excellent watchdog.",
    "height": "up to 10 inches tall at the shoulder",
    "lifeSpan": "11 to 13 years",
    "weight": "18 to 22 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23082_scottish-terrier-460x290.jpg"
  },
  {
    "name": "sealyham terrier",
    "description": "The Sealyham Terrier dog breed was originally bred to hunt otters, foxes, and badgers. Today, these clowns of the terrier family are primarily companion dogs and a good choice for novice pet parents.",
    "height": "up to 10 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "22 to 24 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23084_sealyham-terrier-460x290.jpg"
  },
  {
    "name": "segugio italiano",
    "description": "The Segugio Italiano dog breed originated in Italy back in ancient times to work as a scenthound during hunts. Today, people know this medium-sized breed as an energetic and sociable companion.",
    "height": "19 to 23 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "40 to 62 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/05/Segugio-Italiano-dog-breed-picture-cover.jpg"
  },
  {
    "name": "sheepadoodle",
    "description": "The Sheepadoodle is a mixed breed dog — a cross between the Old English Sheepdog and Poodle dog breeds. Smart, playful, and loving, these pups inherited some of the best traits from both of their parents.",
    "height": "16 to 22 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "60 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/sheepadoodle-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "shepadoodle",
    "description": "The Shepadoodle is a crossbreed composed from two beloved breeds. They are developed for dog parents who need a companion who can function as either a working dog or simply a dedicated and loyal pet. This is a cross between two popular large breeds: the German Shepherd and the Poodle (typically, the Standard Poodle). This breed is energetic and athletic, and can keep up (or outdo you!) at many outdoor activities.",
    "height": "22 to 28 inches",
    "lifeSpan": "9 to 12 years",
    "weight": "60 to 90 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/shepadoodle.jpg"
  },
  {
    "name": "shepsky",
    "description": "The Shepsky is a mixed breed dog–a cross between the German Shepherd and Siberian Husky dog breeds. Medium in size, energetic, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "20 to 25 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "45 to 88 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/shepsky-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "shetland sheepdog",
    "description": "Canines of the Shetland Sheepdog dog breed stood guard for farmers in the Shetland Islands off the coast of Scotland, keeping hungry birds and sheep out of the farmer’s garden, and they served as herding dogs as well. Today they’re excellent family companions and superstars in dog sports.",
    "height": "13 to 16 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "starts at 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23198_shetland-sheepdog-460x290.jpg"
  },
  {
    "name": "shiba inu",
    "description": "The Shiba Inu dog breed was originally bred to flush birds and small game, and was occasionally used to hunt wild boar. They’re one of Japan’s six native breeds: Akita (large), Kishu, Hokkaido, Kai, Shikoku (medium), and Shiba (small).",
    "height": "13 to 17 inches tall at the shoulder",
    "lifeSpan": "12 to 16 years",
    "weight": "17 to 23 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23160_shiba-inu-460x290.jpg"
  },
  {
    "name": "shichon",
    "description": "The Shichon is a mixed breed dog–a cross between the Shih Tzu and the Bichon Frise dog breeds. Affectionate, intelligent, and outgoing, these pups inherited some of the best qualities from both of their parents.",
    "height": "9 to 12 inches",
    "lifeSpan": "12 to 18 years",
    "weight": "9 to 15 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/shichon-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "shih-poo",
    "description": "The Shih-Poo is a mixed breed dog — a cross between the Shih Tzu and Toy Poodle dog breeds. Small, hypoallergenic and cuddly companions, these pups inherited some of the best qualities from both of their parents.",
    "height": "8 to 18 inches",
    "lifeSpan": "13 to 17+ years",
    "weight": "8 to 18 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/shih-poo-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "shih tzu",
    "description": "The name “Shih Tzu” means little lion, but there’s nothing fierce about this dog breed. This pooch is a lover, not a hunter.",
    "height": "9 to 10 inches tall at the shoulder",
    "lifeSpan": "10 to 16 years",
    "weight": "9 to 16 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23126_shih-tzu-460x290.jpg"
  },
  {
    "name": "shikoku",
    "description": "One of the six primitive dog breeds native to Japan, the Shikoku was domesticated by Matagi (Japanese traditional hunters) sometime in the 1700s. Today, people mainly have these dogs as companions and watchdogs.",
    "height": "17 to 22 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "35 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/06/shikoku-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "shiloh shepherd",
    "description": "The Shiloh Shepherd is an intelligent companion dog who responds well to training. Their gentle personality makes them excellent service dogs or therapy dogs. They’re very similar in appearance to a German Shepherd Dogs, but larger.",
    "height": "26 to 30 inches",
    "lifeSpan": "9 to 14 years",
    "weight": "80 to 130 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/03/shiloh-shepherd-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "shiranian",
    "description": "The Shiranian is a mixed breed dog — a cross between the Shih Tzu and Pomeranian breeds. Small, adorable, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "7 to 12 inches",
    "lifeSpan": "12 to 16 years",
    "weight": "4 to 16 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/shiranian-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "shollie",
    "description": "The Shollie is a mixed breed dog — a cross between the German Shepherd Dog and Border Collie dog breeds. Intelligent, energetic, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "21 to 29 inches",
    "lifeSpan": "13 to 15 years",
    "weight": "70 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/shollie-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "shorkie",
    "description": "The Shorkie is a mixed breed dog — a cross between the Shih Tzu and Yorkshire Terrier dog breeds. Small, fierce, and loyal, these pups inherited some of the best qualities from both of their parents.",
    "height": "6 to 14 inches",
    "lifeSpan": "11 to 16 years",
    "weight": "5 to 15 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/08/shorkie-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "siberian husky",
    "description": "The Siberian Husky dog breed has a beautiful, thick coat that comes in a multitude of colors and markings. Their blue or multi-colored eyes and striking facial masks only add to the appeal of this breed, which originated in Siberia.",
    "height": "20 to 23 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "35 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22948_siberian-husky-460x290.jpg"
  },
  {
    "name": "silken windhound",
    "description": "The Silken Windhound is an affectionate, playful, and eager-to-please dog breed. They’re easily trained and love their families, including those with small children and pets. In fact, their affectionate nature makes them poor watchdogs. That’s because they are likely to react to strangers with warm greetings instead of barks or growls.",
    "height": "18 to 23.5 inches",
    "lifeSpan": "14 to 20 years",
    "weight": "20 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2018/07/silken-windhound-dog-breed-pictures-cover-460x260.jpg"
  },
  {
    "name": "silky terrier",
    "description": "The Silky Terrier dog breed exemplifies the expression “small dog, big personality.” Weighing just eight to ten pounds when full grown, they’re tough and confident, perhaps because of their heritage as a hunter of small prey.",
    "height": "9 to 10 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "8 to 10 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23128_silky-terrier-460x290.jpg"
  },
  {
    "name": "skye terrier",
    "description": "The Skye Terrier is a medium-size dog breed developed on the Isle of Skye in Scotland. They were originally bred to hunt and kill badger, otter, and fox, but these days they’re appreciated as a versatile companion breed.",
    "height": "9 to 10 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "25 to 40 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23086_skye-terrier-460x290.jpg"
  },
  {
    "name": "sloughi",
    "description": "The Sloughi is a one-person or one-family dog breed who’s affectionate with their own people but aloof toward strangers. Like many hounds, their stubborn nature can make them too much of a handful for first-time dog parents.",
    "height": "24 to 29 inches tall at the shoulder",
    "lifeSpan": "12 to 16 years",
    "weight": "40 to 63 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23260_sloughi-dog-breed-picture-460x290.jpg"
  },
  {
    "name": "slovakian wirehaired pointer",
    "description": "The Slovakian Wirehaired Pointer dog breed emerged in Slovakia after the Second World War. Today, people know this medium-sized breed as an energetic and loyal companion.",
    "height": "22.5 to 26.5 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "50 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/04/Slovakian-Wirehaired-Pointer-dog-breed-picture-cover.jpg"
  },
  {
    "name": "slovensky cuvac",
    "description": "The Slovensky Cuvac dog breed emerged in Slovakia where they worked as livestock guardian dogs in harsh mountain conditions. Today, people know dogs of this large-sized breed as faithful, protective companions.",
    "height": "22 to 28 inches",
    "lifeSpan": "11 to 13 years",
    "weight": "68 to 100 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/03/Slovensky-Cuvac-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "slovensky kopov",
    "description": "The Slovensky Kopov dog breed emerged in Slovakia where they worked as dedicated hunting dogs. Today, people know this medium-sized breed is known for being independent and active.",
    "height": "15 to 20 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "33 to 44 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/03/Slovensky-Kopov-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "small munsterlander pointer",
    "description": "This Small Munsterlander Pointer dog breed is affectionate with family, kids, and other dogs alike. The excel at water retrieving, and if you’re not a hunter, you’ll need to find other ways to give them physical and mental exercise — they need plenty of both.",
    "height": "19 to 22 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "40 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23256_small-munsterlander-pointer-460x290.jpg"
  },
  {
    "name": "soft coated wheaten terrier",
    "description": "Sturdy and fun loving, the Soft Coated Wheaten Terrier dog breed is a friend to one and all. They’re relatively easygoing for a terrier, need a moderate amount of exercise, and can make a great family dog.",
    "height": "17 to 19 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "30 to 40 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23088_soft-coated-wheaten-terrier-460x290.jpg"
  },
  {
    "name": "spanish mastiff",
    "description": "The Spanish Mastiff is a purebred working dog with an old history of serving as a guardians for sheep and livestock. Protective, loving, and calm, these gentle giants have become popular guard dogs and family pets alike.",
    "height": "26 to 35 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "140 to 220 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/spanish-mastiff-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "spanish water dog",
    "description": "The Spanish Water Dog breed emerged in the Iberian Peninsula in Europe where they worked as herding dogs. Today, people know this medium-sized dog as an intelligent and loyal companion.",
    "height": "15 to 20 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "30 to 50 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/04/spanish-water-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "spinone italiano",
    "description": "The Spinone Italiano is an energetic gun dog originally bred for hunting. Today, many spend their time as companion animals. Medium in size, loyal, and athletic, this dog would be great for an active family on the go.",
    "height": "22 to 28 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "61 to 86 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2018/08/spinone-italiano-dog-breed-pictures-header-460x260.jpg"
  },
  {
    "name": "springador",
    "description": "The Springador is a mixed breed dog–a cross between the Springer Spaniel and Labrador Retriever dog breeds. Loyal, friendly and smart, these pups inherited some of the best qualities from both of their parents.",
    "height": "18 to 24 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "50 to 90 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/11/springador-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "springerdoodle",
    "description": "The Springerdoodle is a crossbreed composed from two beloved breeds. For dog parents who need a medium-sized and playful companion with the best of all their parent breeds, look no further. This is a cross between two popular breeds: the English Springer Spaniel, and the Poodle (typically Miniature). This breed is huge in personality, and can be a rewarding companion for many different lifestyles.",
    "height": "14 to 22 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "25 to 58 inches",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/springerdoodle.jpg"
  },
  {
    "name": "stabyhoun",
    "description": "Affectionate and tolerant, the Stabyhoun hunting dog breed gets along with people, kids, and other pets. However, like all sporting breeds, they need a great deal of exercise to stay happy and calm. They excel at water retrieving in particular, but also enjoy other canine sports.",
    "height": "19 to 20 inches tall at the shoulder",
    "lifeSpan": "13 to 14 years",
    "weight": "45 to 50 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23264_Stabyhoun-dog-breed.jpg"
  },
  {
    "name": "staffordshire bull terrier",
    "description": "Although they were created in 19th-century Britain to be a small, fast fighting dog, those days are long past. The Staffordshire Bull Terrier dog breed of today is a fine companion known for their courage, intelligence, and love of children.",
    "height": "14 to 16 inches tall at the shoulder",
    "lifeSpan": "12 to 14 years",
    "weight": "24 to 38 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23292_staffordshire-bull-terrier-460x290.jpg"
  },
  {
    "name": "staffy bull bullmastiff",
    "description": "The Staffy Bull Bullmastiff is a mixed breed dog — a cross between the Staffordshire Bull Terrier and the Bullmastiff breeds. Calm, devoted, and affectionate, these pups inherited some of the best qualities from both of their parents.",
    "height": "14 to 27 inches",
    "lifeSpan": "12 to 16 years",
    "weight": "38 to 130 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/07/staffy-bullmastiff-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "standard schnauzer",
    "description": "Standard Schnauzers were originally bred to be ratters, guard dogs, and all-purpose dogs on German farms. Their versatility, medium size, protective nature, and love of family make them an excellent companion dog breed.",
    "height": "1 foot, 5 inches to 1 foot, 8 inches tall at the shoulder",
    "lifeSpan": "13 to 16 years",
    "weight": "30 to 50 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22950_standard-schnauzer-460x290.jpg"
  },
  {
    "name": "sussex spaniel",
    "description": "Long and low, with a unique golden liver color, the Sussex Spaniel dog breed was developed in Sussex County, England, to flush birds into the air for hunters. They have a reputation for being slow and sedate, but they liven up when they scent birds.",
    "height": "1 foot, 1 inch to 1 foot, 3 inches tall at the shoulder",
    "lifeSpan": "11 to 14 years",
    "weight": "35 to 45 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22994_sussex-spaniel-460x290.jpg"
  },
  {
    "name": "swedish lapphund",
    "description": "The Swedish Lappund, also called the Swedish Lappie or just Lappie by enthusiasts, is a member of the Spitz family along with Siberian Huskies, Akitas, and Alaskan Malamutes.",
    "height": "16 to 20 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "30 to 45 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/08/swedish-lapphund-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "swedish vallhund",
    "description": "True to their heritage as a working farm dog breed, the Swedish Vallhund is an intelligent and alert companion. They’re active dogs who need equally active pet parents.",
    "height": "11 inches to 1 foot, 1 inch tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "22 to 35 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2014/06/file_23298_Swedish-Vallhund-dog-breed.jpg"
  },
  {
    "name": "taiwan dog",
    "description": "An ancient dog breed, the Taiwan Dog has been a loyal companion to humans for centuries. Although these versatile dogs are mostly found in their native country today, enthusiasm for the rare breed is rising.",
    "height": "16 to 21 inches",
    "lifeSpan": "10 to 13 years",
    "weight": "25 to 40 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/07/taiwan-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "terripoo",
    "description": "The Terripoo is a cross between the Australian Terrier and the miniature Poodle. Intelligent, intuitive, and playful, these small dogs make excellent family pets.",
    "height": "9 to 15 inches",
    "lifeSpan": "10 to 15 years",
    "weight": "10 to 14 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/01/terripoo-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "texas heeler",
    "description": "The Texas Heeler is a mixed breed dog–a cross between the Australian Cattle Dog and Australian Shepherd dog breeds. Intelligent, hard-working, and energetic, these herding pups inherited some of the best qualities from both of their parents.",
    "height": "16 to 22 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "25 to 50 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/02/texas-heeler-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "thai ridgeback",
    "description": "The Thai Ridgeback might have existed naturally for centuries, but it wasn’t until about 350 years ago that humans domesticated them to guard, pull carts, and hunt down vermin. This headstrong-but-loyal breed was unheard of outside of its native Thailand. However, as of late, this dog is becoming more and more popular around the globe.",
    "height": "20 to 24 inches",
    "lifeSpan": "10 to 13 years",
    "weight": "35 to 75 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/10/Thai-Ridgeback-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "tibetan mastiff",
    "description": "This still-primitive Tibetan Mastiff dog breed was developed centuries ago in Tibet. Originally used as guard dogs for livestock and property, Tibetan Mastiffs can still be found performing that role, but they also enjoy life as family companions and show dogs.",
    "height": "2 feet to 2 feet, 2 inches tall at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "75 to 160 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22952_tibetan-mastiff-460x290.jpg"
  },
  {
    "name": "tibetan spaniel",
    "description": "Small but active and alert, the Tibetan Spaniel dog breed hails from mountainous Tibet, where these dogs served as a companions and watchdogs. They’re known for their intelligence, easy-care coat, and desire to keep watch over their family from high perches in the house.",
    "height": "from 10 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "9 to 15 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23162_tibetan-spaniel-460x290.jpg"
  },
  {
    "name": "tibetan terrier",
    "description": "The Tibetan Terrier was created to be a companion and friend. Dogs of this breed love being with people and are adaptable to a variety of homes and lifestyles. Their shaggy coat is attractive but requires frequent grooming.",
    "height": "14 to 16 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "20 to 24 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23164_tibetan-terrier-460x290.jpg"
  },
  {
    "name": "tornjak",
    "description": "The Tornjak dog breed originated in the countries of Bosnia and Croatia with the purpose of being a livestock guardian dog who thrives in mountain conditions and terrain. Today, people know this medium-sized breed for making loyal and sociable companions.",
    "height": "23 to 28 inches",
    "lifeSpan": "12 to 14 years",
    "weight": "60 to 110 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/04/tornjak-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "tosa",
    "description": "The Tosa dog breed originated in Japan, sadly with the purpose of being a fighting dog. Today people know dogs of this large-sized breed as protective and intelligent guardians.",
    "height": "24 to 32 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "80 to 200 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/04/tosa-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "toy fox terrier",
    "description": "Originally created as a smaller version of their larger Smooth Fox Terrier dog breed ancestors, the Toy Fox Terrier has been used for a variety of tasks, serving as ratters on farms and as hunters of small game such as squirrel. Their most important purpose, however, is to be loyal, loving, and devoted companions who amuse and entertain their families.",
    "height": "8 to 11 inches at the shoulder",
    "lifeSpan": "13 to 14 years",
    "weight": "3 to 7 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23130_toy-fox-terrier-460x290.jpg"
  },
  {
    "name": "transylvanian hound",
    "description": "The Transylvanian Hound isn’t a vampire, but it is a dog breed as ancient as the myth of blood-hungry monsters. The breed was popular among Hungarian royalty and hunters alike but almost went extinct in the early 20th century. However, enthusiasts revived the breed and made these dogs into the adaptable and loyal companions they are today.",
    "height": "18 to 25 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "55 to 77 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/07/transylvanian-hound-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "treeing tennessee brindle",
    "description": "The Treeing Tennessee Brindle dog breed stands out among the hounds for their brindle coat. But their fans are more interested in their ability to send prey up a tree and hold it until the hunter arrives.",
    "height": "16 to 24 inches tall at the shoulder",
    "lifeSpan": "10 to 12 years",
    "weight": "30 to 45 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23280_what-is-a-treeing-tennessee-brindle-dog.jpg"
  },
  {
    "name": "treeing walker coonhound",
    "description": "The Treeing Walker Coonhound dog breed has a short, clear bark and a passion for the hunt. Some are shy, some are confident, but they’re all hounds — meaning, they need patient training and plenty of exercise.",
    "height": "20 to 27 inches tall at the shoulder",
    "lifeSpan": "12 to 13 years",
    "weight": "45 to 80 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23250_treeing-walker-coonhound-460x290.jpg"
  },
  {
    "name": "utonagan",
    "description": "The Utonagan is a newer crossbreed composed from three long-beloved breeds. With a strong personality and elegant build, this breed was developed to mimic the appearance of a wolf. But, they have all the good qualities of domestic dogs. This is a cross between three similar large breeds. They are the Alaskan Malamute, the Siberian Husky, and the  German Shepherd. This breed is not only large in size, they have huge personalities, too.",
    "height": "23 to 30 inches",
    "lifeSpan": "9 to 12 years",
    "weight": "65 to 100",
    "image": "https://www.dogtime.com/assets/uploads/2022/11/utonagan-Grant-Glendinning-Photography.jpg"
  },
  {
    "name": "valley bulldog",
    "description": "The Valley Bulldog is a mixed breed dog–a cross between the Boxer and English Bulldog breeds. Medium in size, active, and loyal, these pups inherited some of the best qualities from both of their parents",
    "height": "12 to 25 inches",
    "lifeSpan": "8 to 12 years",
    "weight": "50 to 125 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/valley-bulldog-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "vizsla",
    "description": "Created in Hungary to work as a pointer and retriever, the Vizsla dog breed has an aristocratic bearing. All they really want, though, is to be loved.",
    "height": "21 to 24 inches tall at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "45 to 65 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22996_vizsla-460x290.jpg"
  },
  {
    "name": "weimaraner",
    "description": "Originally bred as a gundog to handle big game like deer and bear, the Weimaraner, or “Silver Ghost,” was a highly sought-after dog breed in their native Germany. Today, these elegant but demanding dogs can still be found out on the hunting grounds. However, they can also make fine family friends if they get enough exercise.",
    "height": "23 to 27 inches tall at the shoulder",
    "lifeSpan": "11 to 13 years",
    "weight": "55 to 85 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_22998_weimaraner-460x290.jpg"
  },
  {
    "name": "weimardoodle",
    "description": "The Weimardoodle is a crossbreed composed from two beloved breeds. They are developed for dog parents who need a companion who can function as either a working dog or simply a dedicated and loyal pet. This is a cross between two popular large breeds: the Weimaraner and the Poodle (typically, the Standard Poodle). This breed is energetic and athletic, and can keep up (or outdo you!) at many outdoor activities.",
    "height": "20 to 26 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "54 to 80 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2022/12/weimardoodle.jpg"
  },
  {
    "name": "welsh springer spaniel",
    "description": "The Welsh Springer Spaniel dog breed was developed as a gundog to flush, or spring, game in the field. A faithful companion, they’re a favorite of discriminating hunters and families.",
    "height": "17 to 19 inches tall at the shoulder",
    "lifeSpan": "10 to 15 years",
    "weight": "35 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23000_welsh-springer-spaniel-460x290.jpg"
  },
  {
    "name": "welsh terrier",
    "description": "The Welsh Terrier dog breed‘s zest for life is contagious, and they always enjoy themselves to the fullest. Bred to hunt independently, with all the self-determination and intelligence that entails, the happy and lively Welshie rarely gets tired and wants to spend their days having fun, fun, fun!",
    "height": "14 to 15 inches tall at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "up to 20 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23090_welsh-terrier-460x290.jpg"
  },
  {
    "name": "west highland white terrier",
    "description": "The best way to describe the wee West Highland White Terrier dog breed from Scotland is simply to say that they’re so full of self-esteem that they know they’re the best thing around. Always on the lookout for a good time, they’ll make you laugh while they entertain themselves.",
    "height": "10 to 11 inches tall at the shoulder",
    "lifeSpan": "12 to 16 years",
    "weight": "13 to 22 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23092_west-highland-white-terrier-460x290.jpg"
  },
  {
    "name": "westiepoo",
    "description": "The Westiepoo is a mixed breed dog — a cross between the West Highland White Terrier and Poodle dog breeds. Clever, active, and affectionate, these pups inherited some of the best qualities from both of their parents.",
    "height": "11 to 17 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "20 to 35 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/09/westiepoo-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "whippet",
    "description": "The Whippet dog breed was a hunter’s best friend, speedily going after rabbits and other small game. Today the breed competes in agility, flyball, lure coursing, rally, and obedience and is a loving therapy dog.",
    "height": "18 to 22 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "18 to 48 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23048_whippet-460x290.jpg"
  },
  {
    "name": "whoodle",
    "description": "The Whoodle is a mixed breed dog — a cross between the Soft-Coated Wheaten Terrier and Poodle dog breeds. Playful, friendly, and active, these pups inherited some of the best qualities from both of their parents.",
    "height": "12 to 20 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "20 to 45 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2019/07/whoodle-mixed-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "wirehaired pointing griffon",
    "description": "The Wirehaired Pointing Griffon is a happy and loving dog breed. They make excellent gundogs or family companions, and they suffers from comparatively few diseases. With their sense of humor and lively nature, they’re a good match for an energetic family looking for a dog to be part of their daily activities.",
    "height": "20 to 24 inches tall at the shoulder",
    "lifeSpan": "10 to 14 years",
    "weight": "50 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23002_wirehaired-pointing-griffon-460x290.jpg"
  },
  {
    "name": "working kelpie",
    "description": "The Working Kelpie dog breed originated in Australia with the purpose of being a working dog who specializes in dealing with sheep and livestock. Today, people know this medium-sized breed for making attentive and energetic companions.",
    "height": "18 to 25 inches",
    "lifeSpan": "12 to 15 years",
    "weight": "28 to 60 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2022/04/Working-Kelpie-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "xiasi",
    "description": "The Xiasi is a breed that few of us will have the pleasure of seeing in person. However, there’s lots to admire about this rare white dog. The Xiasi, also known as the Xiasi Hound, hails from China — and less than 300 remain. ",
    "height": "18 to 22 inches",
    "lifeSpan": "10 to 14 years",
    "weight": "44 to 66 lbs",
    "image": "https://www.dogtime.com/assets/uploads/2023/01/GettyImages-1257120243-1.jpg"
  },
  {
    "name": "xoloitzcuintli",
    "description": "The Xoloitzcuintli dog breed — sometimes called the Mexican Hairless or just Xolo — may well have descended from the first dogs to set paw on the North American continent.",
    "height": "1 foot, 6 inches to 1 foot, 11 inches tall at the shoulder",
    "lifeSpan": "14 to 20 years",
    "weight": "10 to 50 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2012/02/file_23296_Xoloitzcuintli-dog-breed-460x290.jpg"
  },
  {
    "name": "yakutian laika",
    "description": "The Yakutian Laika is an ancient dog breed from the cold region of Yakutia, an area of northern Russia with extreme temperatures. The Sahka people of the region developed the breed not only to be an impressive sled dog, but a part of the human family as well.",
    "height": "20 to 23 inches",
    "lifeSpan": "10 to 12 years",
    "weight": "40 to 55 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2020/11/Yakutian-Laika-dog-breed-pictures-cover.jpg"
  },
  {
    "name": "yorkipoo",
    "description": "A fun-loving “designer dog” — and therefore a mixed dog breed — a Yorkipoo is a cross between the Yorkshire Terrier and a Toy or Miniature Poodle. Intelligent, affectionate, and gentle, they make a delightful companion. They also fit in perfectly to apartment life, especially if you don’t mind the barking.",
    "height": "7 to 15 inches tall at the shoulder",
    "lifeSpan": "10 to 15 years",
    "weight": "3 to 14 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23208_yorkipoo-460x290.jpg"
  },
  {
    "name": "yorkshire terrier",
    "description": "Small in size but big in personality, the Yorkshire Terrier makes a feisty but loving companion. The most popular toy dog breed in the United States, the “Yorkie” has won many fans with their devotion to their owners, their elegant looks, and their suitability to apartment living.",
    "height": "8 to 9 inches tall at the shoulder",
    "lifeSpan": "12 to 15 years",
    "weight": "4 to 6 pounds",
    "image": "https://www.dogtime.com/assets/uploads/2011/01/file_23132_yorkshire-terrier-460x290.jpg"
  }
]
